// puzzles.js
const puzzles = [
    {
        "id": "001",
        "grid": `情機少其時太空原中是價門
                 勤事洛課常非行懷榮蓋無批
                 朗鳥在陽非想先華竹太之報
                 及發月人紙入富待華北保腦
                 密才時明為貴人之集王文率
                 人帶不主星接古當及班門地
                 大想費解物稀務物大無弄府
                 因卡司新之換以正地貴身替
                 報抱印年多類星貌咪海分細
                 果之家或聚化逢移取區義剛
                 器而與向天吉兇上碼人木訥
                 大晚成人之每天晚分分折和`.replace(/\n|\s/g, ""),
        "answer": "物以稀為貴"
    },
    {
        "id": "002",
        "grid": `彬兵冷億灰心情舉悲澆愁抽
                 賓千班無臉頭眉仇更眉苦刀
                 有裂軍不辛辣土田苦酸吮斷
                 理決之萬醒腦記臉留更水文
                 上不鬼神馬揠是龐人火便生
                 往新溫齒龍入苗心門徒故變
                 來家徒故經不不助看截在為
                 去增詞送知古黃敷長時一次
                 字取原所曲新天補出台影店
                 如敗措散人終短經手無水留
                 髮另文兵接相兵舊每金間草
                 大台老開槍一人快使美句花`.replace(/\n|\s/g, ""),
        "answer": "馬不知臉長"
    },
    {
        "id": "003",
        "grid": `瞭崗四心笑花學丈萬都林市
                 合臥亂方平裡治負器所零流
                 日如落大親入藏片豪屬叢離
                 麻週灑路不霞蒼刀行從心事
                 天木替上劍樂侯素光天祥故
                 店破不至命天始心花劍北人
                 風含清仁漏之直亂不試影西
                 題少社大斬口墜進終屢月詞
                 排不是草快釘樓水的棄得黃
                 樓恩除恩律朵截台如煙每賀
                 房根容不復否頤鐵魚登光濃
                 分急緩言刻不可置遙步之天`.replace(/\n|\s/g, ""),
        "answer": "快刀斬亂麻"
    },
    {
        "id": "004",
        "grid": `預風結急影無記以久日觸幾
                 雅完件顧字研聯出藉類重情
                 比神偏享旅各神似旁發出先
                 得志出做懷入角通部制不制
                 轉眾城鬼化喜般按廣任除戶
                 感日胎外沒兔出就人大足較
                 今逞千煙柔神五望人秀旺在
                 真當聲竅盛內曝野外是可礙
                 匹字處琴俱共剛慧線商目助
                 勇副喜焚煮舉中推辣話前首
                 有永入細可賀信享知米無為
                 磨到獲入重釋熟能聲巧覆男`.replace(/\n|\s/g, ""),
        "answer": "內神通外鬼"
    },
    {
        "id": "005",
        "grid": `薄雄才略郎謀心中荒景山同
                 慣兒生才易容身術霧力黃名
                 養驕女以間還有邊不片課盛
                 非貌子情人髮牙從甲正民容
                 天想切痛長死心不秀急緩豐
                 深急身目含網留水清故輕物
                 大仁中之交廣到名效穿狀重
                 事無補生死牽生大擾望及立
                 人列於得智會公一同人金人
                 手並兩驅欲無號固床小盟言
                 抱重齊三私岸貨大夢木異石
                 缺殘行家為界蓋興見土竹絲`.replace(/\n|\s/g, ""),
        "answer": "女大不中留"
    },
    
];