// puzzles.js
const puzzles = [
    {
        "id": "001",
        "grid": `情機少其時太空原中是價門
                 勤事洛課常非行懷榮蓋無批
                 朗鳥在陽非想先華竹太之報
                 及發月人紙入富待華北保腦
                 密才時明為貴人之集王文率
                 人帶不主星接古當及班門地
                 大想費解物稀務物大無弄府
                 因卡司新之換以正地貴身替
                 報抱印年多類星貌咪海分細
                 果之家或聚化逢移取區義剛
                 器而與向天吉兇上碼人木訥
                 大晚成人之每天晚分分折和`.replace(/\n|\s/g, ""),
        "answer": "物以稀為貴"
    },
    {
        "id": "002",
        "grid": `彬兵冷億灰心情舉悲澆愁抽
                 賓千班無臉頭眉仇更眉苦刀
                 有裂軍不辛辣土田苦酸吮斷
                 理決之萬醒腦記臉留更水文
                 上不鬼神馬揠是龐人火便生
                 往新溫齒龍入苗心門徒故變
                 來家徒故經不不助看截在為
                 去增詞送知古黃敷長時一次
                 字取原所曲新天補出台影店
                 如敗措散人終短經手無水留
                 髮另文兵接相兵舊每金間草
                 大台老開槍一人快使美句花`.replace(/\n|\s/g, ""),
        "answer": "馬不知臉長"
    },
    {
        "id": "003",
        "grid": `瞭崗四心笑花學丈萬都林市
                 合臥亂方平裡治負器所零流
                 日如落大親入藏片豪屬叢離
                 麻週灑路不霞蒼刀行從心事
                 天木替上劍樂侯素光天祥故
                 店破不至命天始心花劍北人
                 風含清仁漏之直亂不試影西
                 題少社大斬口墜進終屢月詞
                 排不是草快釘樓水的棄得黃
                 樓恩除恩律朵截台如煙每賀
                 房根容不復否頤鐵魚登光濃
                 分急緩言刻不可置遙步之天`.replace(/\n|\s/g, ""),
        "answer": "快刀斬亂麻"
    },
    {
        "id": "004",
        "grid": `預風結急影無記以久日觸幾
                 雅完件顧字研聯出藉類重情
                 比神偏享旅各神似旁發出先
                 得志出做懷入角通部制不制
                 轉眾城鬼化喜般按廣任除戶
                 感日胎外沒兔出就人大足較
                 今逞千煙柔神五忘人秀旺在
                 真當聲竅盛內曝野外是可礙
                 匹字處琴俱共剛慧線商目助
                 勇副喜焚煮舉中推辣話前首
                 有永入細可賀信享知米無為
                 磨到獲入重釋熟能聲巧覆男`.replace(/\n|\s/g, ""),
        "answer": "內神通外鬼"
    },
    {
        "id": "005",
        "grid": `薄雄才略郎謀心中荒景山同
                 慣兒生才易容身術霧力黃名
                 養驕女以間還有邊不片課盛
                 非貌子情人髮牙從甲正民容
                 天想切痛長死心不秀急緩豐
                 深急身目含網留水清故輕物
                 大仁中之交廣到名效穿狀重
                 事無補生死牽生大擾望及立
                 人列於得智會公一同人金人
                 手並兩驅欲無號固床小盟言
                 抱重齊三私岸貨大夢木異石
                 缺殘行家為界蓋興見土竹絲`.replace(/\n|\s/g, ""),
        "answer": "女大不中留"
    },
    {
        "id": "006",
        "grid": `牛虎質行需維四科舉月色僻
                 吳皮百費義羊力管迷暖殘望
                 喘宗聲無入倀不一處冷心傷
                 受平反虎能作除凡資知接岸
                 殼顧口惡背為離負夫煙青破
                 勝完水字提熊力尋找俗暗崗
                 兼人而雞歸蜂腰不逆雨子方
                 臥龍犬興交堂腿夸密承懈北
                 常不敗馬替逆狼理父在逅江
                 寧無外有之錯授業恩逐水一
                 典法天中忙勞母拜擅散日紙
                 恩開人吸磁臥皇求奉人稱傘`.replace(/\n|\s/g, ""),
        "answer": "虎父無犬子"
    },   
    {
        "id": "007",
        "grid": `力不重心人默藕吃風爭之口
                 挽動草催風命默斷吹一舌中
                 狂伸眠綿腿瓜關無蟲步嘴有
                 攔舌棉祥延世田天蚊蓮油目
                 不動無吹風外米李衣滑中無
                 打恥期日夜園代世下無眼珠
                 自絕下自投桃外和神量縫人
                 招情禁問僵桃心醫人功取貌
                 設絕不圓源達報滿殊途鬼以
                 想憶中無人太為李意為然輔
                 舞起雞蚊鼓患互出不足毛股
                 自不晾粒而危言聳聽駭人聞`.replace(/\n|\s/g, ""),
        "answer": "桃李滿天下"
    },
    {
        "id": "008",
        "grid": `矮胖受毫賢柴謎由金順心感
                 高市查降時降言亡銀每市凶
                 之戶井處出一命羊新馬無櫃
                 由頁大之足之徐才與天久死
                 小勞尾不徒買大略高仰九均
                 大自而債機碼大大大八九我
                 眼大規賭著五威名貓躲斗落
                 為頁地出易猛啷方鼎降去煙
                 選勞人力師區市方落鼎具竹
                 榮頭弄心要不關關欲琦各不
                 地不自吹點檢利不順逛出剛
                 花用老王瓜直你沼則望高德`.replace(/\n|\s/g, ""),
        "answer": "名師出高徒"
    }, 
    {
        "id": "009",
        "grid": `如髮衝冠河山林人誰能情皆
                 雪兵怒火吞同鳥非草無眾醉
                 星結中燒氣打魯莽恨木人我
                 光金禍連延火英行別鳥皆獨
                 負忍枝金良雄願事一驚醒兵
                 重辱科玉言不拘介感時心快
                 功胸有律葉盡不小花無之樂
                 不成無化用取之節濺人常選
                 必竹頑點之有道餐淚生十如
                 在海石頭墨不公自風朝之意
                 我成爛是所竭人在強露八九
                 金枯虎道能盡心石雨急宿快`.replace(/\n|\s/g, ""),
        "answer": "一枝草一點露"
    },
    {
        "id": "010",
        "grid": `不予求千豆瞪苗讓之招器大
                 木給於頭子敵竹火人兵美晚
                 暇目取萬芽人子軍千馬每成
                 雖勞於序言驚民鈞萬買賣天
                 心費師曲心不一力不罵量地
                 合神來動聊髮由氣心扔存不
                 筆至魄生眾耿耿衷呵如去從
                 夜做金庫襪新風聊虎成止土
                 日深組主愛平火添養兔火水
                 大快人新浪滔翼丁括惹草木
                 虎木含靜句天笑指花奏科土
                 好累類淚門之一曲大夜小前`.replace(/\n|\s/g, ""),
        "answer": "一動不如一靜"
    },
    {
        "id": "011",
        "grid": `無起大快仁欣肘力之雞負手
                 硬冰死快任新擊投苦萬辛千
                 涼荒不回人薪技法無皆腳手
                 品螞活口生心心相硬入知新
                 衷亂眉柳平龍號通情達書連
                 上七招氣暗鬼活勝相八理新
                 八一和箭斧花使虎逼四穩共
                 下表傷神無草明神太通半同
                 裡人工苦中庸之到差信費創
                 腦殘新入推心置腹半新神照
                 居端多記鬼移神疑勞斧犬連
                 之有能錢磨推有幸之馬鷹體`.replace(/\n|\s/g, ""),
        "answer": "疑心生暗鬼"
    },
    {
        "id": "012",
        "grid": `情方舉而在滿白欲由不謀圖
                 適原個規振手不宅包貴子無
                 訴顯有魚起筆起母平羅無貸
                 神惡得家如神疾秀知所萬換
                 通水破混經走後書不念斷象
                 天人之蛇由地達債俱改朝袍
                 亡於本龍掃禮出灰口可第割
                 幸固領風功紙登門雀羅席及
                 緣千若各醉過入車水以格好
                 男萬紫金薰風相室一碼投市
                 善紅迷天湯不機抵所其魚門
                 女福人齊是曠百失離留故若`.replace(/\n|\s/g, ""),
        "answer": "家書抵萬金"
    },
    {
        "id": "013",
        "grid": `其自言而田一倒甘道寅精采
                 來有食肥水魚兩蔗吃眼演出
                 人之做惡因碩食卯乾裡施西
                 欲四端多果十糧抹凡風扒東
                 出祥瑞僅報不淨夫獨流玉外
                 呼乎存應才繼俗儻個樹火銀
                 之一未甘德子之君臨天一花
                 新心拜兼備交佳風軍下三幟
                 天下心師教鄉相人交知千煩
                 風疾自用學長天識點頭口惱
                 馬相不格以藝下滿萬移接絲
                 牛及物知致術百緒就花木耳`.replace(/\n|\s/g, ""),
        "answer": "吃果子拜樹頭"
    },
    {
        "id": "014",
        "grid": `子師像風之大將天章文假大
                 凡俗大況力從心下牙一白地
                 秋穿望言入微子虛鳥般黑見
                 不洩水眼不敷出自有口無新
                 通四吞足欲慟棒堂忘利得見
                 八達道蓋至穿愧不義家義易
                 土雲彌想住吃知容破勇器棄
                 物彰話非和難辭人破獨風瘋
                 花水偉解而信亡所為善難發
                 落昨天退國其欲其惡任才文
                 興石家下負為身天下當敏絲
                 出和萬事人所間善任大節捷`.replace(/\n|\s/g, ""),
        "answer": "為善不欲人知"
    },
    {
        "id": "015",
        "grid": `子人凡秋不通百我三八土物
                 花落定興出師俗口無穿謝四
                 達雲張勝水昨小劫莫苦司貨
                 參業之中天於真覺地辯真藥
                 向不他新宜告有憑才價的王
                 武白是救一他尚無實往用為
                 瞞我望西自決礙打應據新軟
                 友易被資的原雌份八拔還住
                 受得紅大同華曉雄事家子人
                 風制以歸重人才半便在校真
                 頻與於所輩大功出假不人是
                 秋盡成人略倍將為張是無為`.replace(/\n|\s/g, ""),
        "answer": "事實勝於雄辯"
    },
    {
        "id": "016",
        "grid": `箭堂正正術心苦良心惜相心
                 雙一堂不藥良猿氣用別有心
                 成鵬帆而春口若意事汗水灑
                 對成癒風百河懸高馬不蹄淋
                 調風化百順依苦功對停汗如
                 順雨既一裡不勞措吳牛喘雨
                 雙四言表卑下手畫充月彈下
                 對馬出不相不上棟梁雕三琴
                 雙難亢追及子君拔不槍長短
                 對難分押猛義不入刀敬兵二
                 相解秒出兩虎馬虎人相如實
                 鋒爭必一舉得穴物接待助冰`.replace(/\n|\s/g, ""),
        "answer": "風馬牛不相及"
    },
    {
        "id": "017",
        "grid": `夢台商目川若主樣賜傲主先
                 築債光工海大納拙米一認入
                 高如淺魚落巧言勤弱諾自言
                 豆崩魚流農勞力不角簽欺雲
                 穩泰芳得案神禁稜慚分意鬢
                 相百駭牘水風雲留孤克囚魄
                 世惡廢人行不由陌不救劭目
                 軒仁替待聽徑寡欲所堪集謎
                 逼齊研放舉聞開院秋吹一告
                 咄裡視器苦雨言門差針可擊
                 見笑師臨有水難濃見羅雀全
                 廣刀藏高指昂於血清山杉布`.replace(/\n|\s/g, ""),
        "answer": "百聞不如一見"
    },
    {
        "id": "018",
        "grid": `魚江微中整日自大炫春進狀
                 仇敵濱不使期先危言聳義末
                 同家慨訪足發聲人聽不黑可
                 決嘆破勉制道綺奪容耳慚萬
                 待物為人堂禮貌辭勤能補濁
                 接其姿觀亡上商岸對有力貴
                 難響驚破止哄笑網然心分非
                 義測膽節豐秀雷容滿如海陶
                 毛雲顫無外衣指意可止處進
                 骨聳色慧天生足生意外菊水
                 然變中薄戶所枝食先台焚討
                 容失虎措手撥生體調牧粉鶴`.replace(/\n|\s/g, ""),
        "answer": "不足為外人道"
    },
    {
        "id": "019",
        "grid": `難詡惑反不成下記臊地查粗
                 為知儲類伏無天預高彈犯丸
                 事暖欲狗化虎關深石體通持
                 師問虛寒各樹莫沉度力兼容
                 貪用熱一天測大逆少行至並
                 自生方縮後海千招之黎鳴資
                 以正怕入竄秀世催風交樂斥
                 為是負死節基界天屢藍序地
                 非連人哀於光田劍記停田秋
                 非拓順心鴻非及密日海中豪
                 人變不展不遍命中如色太無
                 想忍曲非是古野號七角狼范`.replace(/\n|\s/g, ""),
        "answer": "哀莫大於心死"
    },
    {
        "id": "020",
        "grid": `有小無中有由勞之慰烏鳥倚
                 一名大恃生拍案叫絕鳥合不
                 吃驚無名七步牘處一技之長
                 不恐秋實葉不逢人而黔驢短
                 成語一果因生鬼惆途驢口爭
                 接咫兄作時帳我甚半扣舌燦
                 跑尺龍因虎不咄咄逼人為小
                 怨天尤人異同技兵甚心太財
                 角涯地虎冤床窮黔弓弦死相
                 一海作家夢憤驢鳥之盡得兩
                 之之路不拾遺離福藏人所看
                 含窄逢一步失不禍倚其厭壓`.replace(/\n|\s/g, ""),
        "answer": "天無絕人之路"
    },
    {
        "id": "021",
        "grid": `裡表一來人君天臨有有年心
                 面里不之置不渴下色聲動不
                 離鄉貝井酒掘可藥欲薰期惑
                 白小新上井花有墳救可而藥
                 血骨如添花直理貌墓遇不變
                 換流山明直知秋條分求眾驚
                 湯課成十河年故毫明怒換弓
                 不十年前望東合犯難偷大支
                 換之前勢朋穿獅西墜天拖鳥
                 我們勢年之後秋吼日泥特寬
                 有時年之在們我水帶起脱衣
                 到找也在們我水送行解帶睡`.replace(/\n|\s/g, ""),
        "answer": "井水不犯河水"
    },
    {
        "id": "022",
        "grid": `傷千畫略謀無禮尚桃連完無
                 心天釣財舉互往來李晉弊情
                 地良害一珠不通不面之規有
                 人命反理髮王勇有利交照唯
                 關三退勞買之難人無慾無價
                 天難型案瀆色天才華傷薰逃
                 義之流珠環膽百武洋役大心
                 二冰三芳才發歡公髮工之雅
                 是壞傳鄉百樂家皆則需有而
                 傳門出中死世合臻每求過有
                 千不不拼者密國地一環怡所
                 裡外不是罷前為家保家居不`.replace(/\n|\s/g, ""),
        "answer": "有百害無一利"
    },
    {
        "id": "023",
        "grid": `術獨飛雲兒闊掏刀斧班龍大
                 數當奔盡弓生土望破爭拓國
                 處一兔鳥藏三揮閒虎色變沾
                 是促數狗心諾細鬥朋堵務岩
                 一促縮二音千路零懷緩當輕
                 剛逐意物窮容金高水才及身
                 言是駐敗光山宛凹漲船不巧
                 往成族煥明木惡在萬由弄遇
                 記晚發水地起一水己做一逢
                 可器秀戶做價入石層心救虎
                 握考色這過按戰生二記盼瀑
                 秀查起睡復騰消用逆鳥切騎`.replace(/\n|\s/g, ""),
        "answer": "一山不容二虎"
    },
    {
        "id": "024",
        "grid": `難的愛拒理仗狗人世幸金涼
                 孤枕抱狂猖郎勢雨言童慾之
                 眠棉匹神亂舞才欺玉配腹口
                 飲布鬼說劫者貴女人記是訟
                 隱瞞事實濟富賤自貌心分心
                 皆眾天俠盜貧困各非頭不違
                 知所倻過賊大由之難臨雙古
                 惜物強將海想小破斷禍半道
                 相一大撈行大井鏡釜簪徒樂
                 線穿針千千萬氣底廢而白腸
                 相到一見花熱抽重之邊木子
                 知連輪滿血薪好圓花蛙耳湯`.replace(/\n|\s/g, ""),
        "answer": "女人心海底針"
    },
    {
        "id": "025",
        "grid": `身庖有始鐘咳不容緩心隨寓
                 身不丁如一心一話不份安而
                 息欲衣解藝語成在守至勿毀
                 建人地之牛識焉下已剩人人
                 好斧闊刀大衣悔不藉癬子不
                 色班門殺槍默對捻詳屍弟倦
                 之弄身旗雞不默泣而義還甚
                 塗之張鳴疤取入無氣博捨魂
                 禍多狗鼓大痕卵用蚊雲師芽
                 多盜功震眼材事草天心寄天
                 打敲鑼喧高主小木自龍是單
                 擊少天地手低心用皆賓弟虎`.replace(/\n|\s/g, ""),
        "answer": "殺雞焉用牛刀"
    },
    {
        "id": "026",
        "grid": `屋勞心勞利籌見日久玉井馬
                 需不萬漏一畫心心樹井旱拍
                 子辦中無成事不臨有大逢迎
                 無毛上臉成足風條亂餘招想
                 份恐有華畫蛇添愁愁七悸風
                 不天不頭蝶引風眉八大之中
                 官武地入有蜂苦下上道行下
                 死戰吉有萬臉頭面是圖為天
                 文官危人正羊大其手關師與
                 諫死空為天器質過制真虎人
                 司巷直田在相庫虎國謀報易
                 其非斥中事為至恨皮王小罷`.replace(/\n|\s/g, ""),
        "answer": "人有臉樹有皮"
    },
    {
        "id": "027",
        "grid": `假真力量見而為有比繳協見
                 影不量田無法無守壞力義信
                 設自在龍槍而自能守勇新勢
                 撒推三摳不入得掌為價均封
                 含逆少思苗到相食前力動原
                 影到光去刀助古無敵身不兵
                 見行光天雙不長處是先士卒
                 下失刀風化無以一檔千守人
                 天小得方雨日我捨推法如惡
                 上變雲一水無騎三乖報指髮
                 天色風回在佳阻誰是張消格
                 幫點春頭望四口可處資智物`.replace(/\n|\s/g, ""),
        "answer": "化阻力為助力"
    },
    {
        "id": "028",
        "grid": `玩完體入家膚長如自森所風
                 人日風出良命無法地放月花
                 格閱渴吹百地天紙無雪中一
                 物致知歲草品不改上矢送得
                 天盡徹心欺動頭加牧談馬洋
                 揮下寒人聲換霜論服舊兵怒
                 驚金太色面物墳祖足宅從不
                 大甚如平水孤毒墓土大興力
                 失色名土盛而來野村俗子怪
                 耳聞不詳道世僻有夫凡不語
                 人服詳願遠中逐鹿資住開花
                 舊人文雅匹夫之勇市資春暖`.replace(/\n|\s/g, ""),
        "answer": "太歲頭上動土"
    },
    {
        "id": "029",
        "grid": `犯豪門天中如欲油多七門恨
                 記人女當看用日秋嘴市庭商
                 耐賽留中戶開人八碩滑可國
                 單尋人源結對舌目僅羅舌月
                 位成事心牛力果及無慎雀指
                 三肥珠彈不無車出人全鹿吳
                 無而琴從虎古人水久為牛露
                 免言心皮火頭枯常馬喘可修
                 狡信謀圖地樹蛇釀月龍一餐
                 軸與瀑土力行銀尾毫揮相風
                 敵寡逢田替威道華唇依取宿
                 窟眾合天秀道重任寒亡齒然`.replace(/\n|\s/g, ""),
        "answer": "牛頭不對馬嘴"
    },
    {
        "id": "030",
        "grid": `器晚慶丹清夢色持及不載備
                 成貴墨躍井關盈琴合歌繁族
                 普天同國論保品論舞而語狂
                 透縱意酒泰英啟名天羽補翼
                 束港虎組丑民落地下關人名
                 駛率農歸眼孫安一行捉花貝
                 樹效村明山高心風代有扇極
                 探鄉手目粗照手老主月餘地
                 魚快田野不活馬低個刺具力
                 百族加宣曠識細曉情是無征
                 長使開翠途夜丁泰非寫屠夫
                 列正懷綜合治直達生手賊駐`.replace(/\n|\s/g, ""),
        "answer": "有眼不識泰山"
    },
    {
        "id": "031",
        "grid": `大照裡使大器停序來狼其床
                 晚之留為粉住特全沒告主落
                 空零短身力救力不軍沒過碼
                 人所碎有敗以中可家覆弄來
                 幽骨有朋赴名女故亂狼沒趕
                 欲之無順帶卡裂是人經幫新
                 不到到忍手一生狀科千是和
                 指機失幾遠牽舉紅釣持勞軸
                 與染方常強入羊一素師黃於
                 爾藍乎附冠衝髮怒動撤欣賀
                 而慣會樂智贏到眾畫計升為
                 貝講西密與逆洛葉捨炎火抗`.replace(/\n|\s/g, ""),
        "answer": "牽一髮動全身"
    },
    {
        "id": "032",
        "grid": `士釋使色聲不按重損患滿圓
                 視式室風吹動不兵人人心得
                 事市逆相草木折老滿滿利功
                 示世惜來得將當受意謙為已
                 勢一不生順益損足招過戰患
                 難求花生壯受彰益六五一站
                 幾得受枝謙託制關匠至者心
                 知易人謙招沖記於是三穿湖
                 難買君兵全展自是人面末九
                 金子買查福新清牧種毛不可
                 千馬愁引新摘成是一拔寧人
                 瞻是首小大下次無霞是席息`.replace(/\n|\s/g, ""),
        "answer": "滿招損謙受益"
    },
    {
        "id": "033",
        "grid": `得意器風發容始骨血各弱製
                 洋化口入水機元相殘肉撤之
                 灑權授火天倚一者強爆橫理
                 人庸之時予絲老食相肝無飛
                 大中義支不失得賣膽義情虐
                 法禍財掛羊炭濁友老照無殺
                 大從臨入一質清求成當天行
                 工入虎頭狗漏虎樂持機益行
                 化口掉尾頭仗萬皮種毛是狀
                 原前續再輕是人肉待賃出原
                 不紹喚心軍稱道勢記風必會
                 意尾散染牛職地欺葬雲有因`.replace(/\n|\s/g, ""),
        "answer": "掛羊頭賣狗肉"
    },
    {
        "id": "034",
        "grid": `大匠鰻身依舊在幾度夕有見
                 之鳥心落昏機可失陽口大風
                 風合秀獨臼迷山窠皆夢落插
                 運之排擠運轉不碑初大大針
                 轉眾志成成道流醒昏方歡皆
                 議紙城賠償離途聽說義上喜
                 見上醉時所失骨我長氣眉稍
                 縫彈生金不丟行杞到用苗樹
                 轉兵夢義迷我人長短事見見
                 舵畫死氣素憂予現鬼人縫風
                 威下馬用天上鬼間眼窠轉插
                 風搓卒事地上人人間臼落針`.replace(/\n|\s/g, ""),
        "answer": "眾人皆醉我獨醒"
    },
    {
        "id": "035",
        "grid": `勉共左小俱面伙放人殺殘相
                 勵為右纏到面伴處畫地語自
                 眼手其鬼有成石龍雜餅自言
                 明到擒難左金點飛鳳蛇充限
                 去來色色右晴爭誰舞龍耳飢
                 自者不形為相威與假蟠有不
                 如具拒形對相威虎無勇起雞
                 來連銷影不撓踞狐謀既舞隨
                 什骨相不屈草憂果花皮翩風
                 毀於肉另離食忘結開金翩流
                 旦一飯相而廢寢肉城石凋落
                 千金眼看殘不裝所致為儻水`.replace(/\n|\s/g, ""),
        "answer": "畫虎畫皮難畫骨"
    },
    {
        "id": "036",
        "grid": `都包星棋肝膽相造氣見義勇
                 市天羅布吞下山上風吞仁為
                 恐一感萬海氣欲雨滿雲山讓
                 怖無師自象雀大來樓吐以河
                 病奉通萬中屏中快語霧裡敬
                 打快千千大選心扣人快弦如
                 易草熱牛方表一心弦心帶實
                 取因驚鬼畫裡不意相戶福持
                 同最身蛇扣古味一天印無豐
                 工知添深無宗色俱而醫衣法
                 之足臥裡藏古身全不足無地
                 妙校裡藏刀底香有食之為縫`.replace(/\n|\s/g, ""),
        "answer": "人心不足蛇吞象"
    },
    {
        "id": "037",
        "grid": `鋼壁投瘋誰爭孔厚非非入享
                 銅鐵坐雨風外仙此妙繆靡一
                 值其享吃理爬草柏筆青罪騎
                 不成醋見山開早賞丹二屋愛
                 文一相心門空花花罰集汙夠
                 怪印心敬把前天不色分壘狠
                 小大而轉如酒亂天之快明魏
                 驚遠逆勝地賓言喜舌口出爾
                 之近分不飛臥完歡地齊煩有
                 下上堪聞道道虎自璧厭不強
                 以此不問斃龍藏璧小的萬格
                 擊卵石醋多刑不以此使年傳`.replace(/\n|\s/g, ""),
        "answer": "敬酒不吃吃罰酒"
    },
    {
        "id": "038",
        "grid": `修七幸患秀燻酌弄無行真劍
                 生午如茫然外亡過巧圍大重
                 身養刺魚圓一慧鏡農言詞盜
                 有犒心內得新花中拙以其鋒
                 背快方大負水勤能食先利假
                 助心驚水月古千言者必力滄
                 動人落為環故而膽多勞海私
                 魄石器井天肥炙瓜民桑力談
                 出昂宇晚下人燕店田不淚塗
                 手宣記密口石之瘦從李聊如
                 闊營為克水欲平心共雨下生
                 張步劬審劍腹鳴魏化整炭靈`.replace(/\n|\s/g, ""),
        "answer": "肥水不落外人田"
    },
    {
        "id": "039",
        "grid": `吾愛舞浩康忘乘離生頸吻天
                 學浪跡天涯子龍死之交之握
                 以得鳩引忘梅關別花驕懷愛
                 緻虛佔止渴頭開如子儒慷武
                 用名雀忘頭面生虛抹家思妙
                 結外朝是蓬垢鳥漆似黑手身
                 心生道同美有金不堪回首異
                 如枝人物玉碧霜玉春處為人
                 偷天換日輝餘不冷滿方虎師
                 心星溢煌芬打罵寒身堂做表
                 移右尚芳自情俏冰而戰帳心
                 慶砍氣招坎婦巧時空慄用自`.replace(/\n|\s/g, ""),
        "answer": "浪子回頭金不換"
    },
    {
        "id": "040",
        "grid": `港樂焦母拋伯常信和啼舞雪
                 角護離遷剛頭經人盡閱鬼破
                 替透口孟頭總露情一本奏上
                 紛貨無是物田本面心塵取獲
                 方物道家心以交山一裂不物
                 兩銀破於可非類改意白歸染
                 景人下時天歸含聚之懂得賀
                 亡落夜我情伊笑冤沙辰映竹
                 麗雅無生有老談風昭成洗環
                 裔大死野天生常成治雪塔裡
                 厚燕牙有若中道家桃裡報投
                 宴研御俠塵田幸七偷助舟飲`.replace(/\n|\s/g, ""),
        "answer": "不是冤家不聚頭"
    },
    {
        "id": "041",
        "grid": `萬傷人得奉順無帆水渠順成
                 年五天石設添水碩風到得仁
                 體獨戰害白下生人欣不古善
                 厚額寄頭理離遠營情千如欲
                 投謊儲屋美恩開外髮有一魚
                 肆老漏虛子趣游願步釣可形
                 個辯馬胸難刃之登口力敵原
                 形名才識有君人若天特勢井
                 新維無餘途成懸云驚不欺下
                 有不礙刻刀河竹書亦賞甚水
                 有所散骨花牛銀樂敗云落太
                 好幕志銘火樹乎皎招風癡失`.replace(/\n|\s/g, ""),
        "answer": "天若有情天亦老"
    },
    {
        "id": "042",
        "grid": `落睡花費版案勞型望成龍大
                 輪成反貴耿憤現賣碩子快婿
                 不畫生原心初行品投人承坦
                 類替蛇忠狀大頭騎心試膽複
                 寧挑刀添言論好有居合小東
                 子息伴不足妥餘樂安家大床
                 虛孔慚界勞悸華音定規秀使
                 孟母武君胸而據咄繞花腿欣
                 省三簽有不理獲所逼樑拳榮
                 市人成實力未人任下至敗歸
                 信竹成爭開擋經淚如重屢戰
                 難騎虎膛臂言車雨遠到凱旋`.replace(/\n|\s/g, ""),
        "answer": "心有餘而力不足"
    },
    {
        "id": "043",
        "grid": `才負翻未瀑到掏費湯新帶夠
                 文思雨雲定在敗功貪無相人
                 荒網敏路以之成人木生降是
                 繆一類捷緣身天勝定兩伯種
                 爭步足面退份作准人等寸死
                 天先箭面邊多事則的中的水
                 登原恐怪耐磨好至號足落面
                 動相興後勞不而華惜石花皆
                 人傑零師間時西在出家溫章
                 搖地動貧問東混愛天人保凱
                 喜眾創作窮罪對談吉相意一
                 不敵寫新聲談牛勤老才人表`.replace(/\n|\s/g, ""),
        "answer": "出師未捷身先死"
    },
    {
        "id": "044",
        "grid": `海幣四徒家鶴寒安拆河暴欲
                 為固志殊立松貧凋於橋無虎
                 家大若同揮樂強博率所思逢
                 故田之金道行替人不層圍騎
                 招步如當湯合群知所防虎思
                 自土齊言黨成萬天書雞耳香
                 夜一招以之紫結下達花念頓
                 情大當兵千過軍髮容日禮頓
                 利事樹紅買方早萬依鳥太義
                 洗逐渡橫期馬百出負語揚綽
                 貧降還任耐尋市計晚餐有奉
                 如珠天孟舉人位市素歸規餘`.replace(/\n|\s/g, ""),
        "answer": "千金難買早知道"
    },
    {
        "id": "045",
        "grid": `柳暗花山困潦倒眼青天飛一
                 窮村窮窮韋混蛇龍中黃中語
                 惡水末途雜編新雨騰的不慌
                 盡見路小末大三達難虎纜接
                 金不家見英路略決死文閱群
                 平碧黑參雄才敏捷思擇法書
                 玉光輝案含笑九泉噴蒸無編
                 生之續煌敦善湧噴蒸貸天旁
                 自勞初身怕欺奇日項款無居
                 前甘泉碧潔惡上型下效高天
                 步踱墮由自愛不瞞君臨嬌皇
                 徑行不落棄白釋手下子之遠`.replace(/\n|\s/g, ""),
        "answer": "上窮碧落下黃泉"
    },
    {
        "id": "046",
        "grid": `一日心頭一徵博引君入敷出
                 秋三上喜當旁為以人甕虎口
                 燈更人三百尺戒云學入美不
                 火口申虎竿頭亦疏淺羊勝收
                 難五成生虎云可言人人得志
                 令更財風生雲畏百出小在夜
                 難有死泉湧起萬口莫必夢日
                 道塗口良報雄卷辯得有行所
                 聽說舍皆師書萬讀迢千我思
                 我行我素碑益會路里迢師得
                 他上其與以文友多雙全全志
                 手下誰爭鋒直諒文武心意滿`.replace(/\n|\s/g, ""),
        "answer": "三人行必有我師"
    },
    {
        "id": "047",
        "grid": `我形我塑孤露寡蚊無默默出
                 不影影約約芳寄不雞徹過人
                 藕相不不勾人自仁敵起恐投
                 斷付上約籍薪悅賞離種舞地
                 蟲之丘下兒有豆德心下有下
                 蓮一有貉到童志餃高悅力鳥
                 住效無求井在凡靜匹望目語
                 居無訂所必底婦夫成夫重花
                 飲禧蚯得有應之品俗心之香
                 餓薪壕不接勇事蛙長子天泳
                 羊蛤燕腸口說無憑品學皆憂
                 膳麵飯淫碑話成謀有求必硬`.replace(/\n|\s/g, ""),
        "answer": "重賞之下必有勇夫"
    },
    {
        "id": "048",
        "grid": `諄乾先不洞商先同紙濟共孤
                 誨為甘禮亡知知上行鄉重執
                 敬示餘綽後燭談餐盛將注犯
                 弱倦小刀女兵為咀計命就愛
                 貪不今一試術詩就位寄不木
                 召淺禁游落高計其人釋思深
                 賓龍翻風然井枕離手知積熟
                 賣先力舞外悅下無心長技慮
                 驢潛獨強如誤寸石憂處氣生
                 記兵中無人鐵大久滿信年巧
                 窮乾火術得久所時氣百不婦
                 滿義必術得久難登米無生為`.replace(/\n|\s/g, ""),
        "answer": "強將手下無弱兵"
    },
    {
        "id": "049",
        "grid": `不蹈機琦百花暢各記新主小
                 可火會年好誓去所字為有大
                 師山樹無合死如求欲其所歸
                 鬧人火銀月如不蓋不言百四
                 養中地此花歸彌叱於時如一
                 碼負取地圓彰記時吒撲帆記
                 翻來之靜瞻顯後不張風碩的
                 師出然了觀出嘆依順淡雲使
                 新身師一目其百為理風炸望
                 敕先大不威脅變具觀清梅山
                 見死識體利益萬念揮止如心
                 庖丁不太誘薰化金渴水土福`.replace(/\n|\s/g, ""),
        "answer": "樹欲靜而風不止"
    },
    {
        "id": "050",
        "grid": `感石胸地外旋合夸幾果門古
                 形日補有同方落告父碩趕可
                 落水口約成促破慈渴逐雀羅
                 出皆而自落竹子望水刻日名
                 碑找具大圓孝投網漲舟及勤
                 件首驥終難其志傳記求劍屢
                 怕聲示兵所在說高萬成沙積
                 調消匿好必鼓樓誤丈銷渾提
                 雕擠跡得軒敗平地人新望點
                 紫針宇器昂授在起嘔子血濃
                 鬼幸似兒麟畫勝握成利弟於
                 迷生獲喜具藏卷龍經濤水發`.replace(/\n|\s/g, ""),
        "answer": "有其父必有其子"
    },
    {
        "id": "051",
        "grid": `糠曉破媚皮身庫先珀琥橙粥
                 屍儲號素心斯能人入克各求
                 婦溼外如畏言世亦雲為週見
                 最最家珍善謀秋雲其有主外
                 新新破道數彿面主勇小聞姿
                 研出人大中不腐無橋水膩姿
                 花品王昭約落謀汁血股堆肥
                 斗斗風而東姿姿而鹽澀季不
                 敏囍同新鞋力息倔合就網一
                 曝薪危病重息按嗆明里敵可
                 蕪格搖尾相眼我煙落花無世
                 飯麵丐關乞憐亂撩苟炘豆餃`.replace(/\n|\s/g, ""),
        "answer": "道不同不相為謀"
    },
    {
        "id": "052",
        "grid": `習從過如蒼天容間竟鳴一事
                 克以遠自息人一髮未話壞存
                 剛柔為若之事無名天卒碩信
                 入機方常無竿寧國大美果演
                 病不情成上先引人況採不僅
                 溼泰身日兩不禮人欲下散人
                 乃斥賀敗有力春後入招定善
                 窟文俱容名心得洋兵勝多主
                 狡傷乃題相裂家買天意惡其
                 兔大安武映財馬喻校引各為
                 誘黃雌口萬照直上戶合東人
                 兩雄是實揮揮暴虎逢曉到至`.replace(/\n|\s/g, ""),
        "answer": "勝敗乃兵家常事"
    },
    {
        "id": "053",
        "grid": `勇田現勝望憂力倒一不理行
                 熊往價心古屢過置之南逐表
                 重府直處度末本河自贖勞而
                 芳口勞前樓語棄命拆強鋪大
                 快式下馬臺水清戲序橋不無
                 僕大難月到高築井造水當息
                 遠于禍渠光成設路漲星任道
                 竹塑成臨發恩功船有披貌之
                 界大骨團頭此高肅堅岸靡絃
                 比田至破東事使出然砲告音
                 避日血風放斥水斯擊起利外
                 舍流當退午滴穿石落放敬地`.replace(/\n|\s/g, ""),
        "answer": "船到橋頭自然直"
    },
    {
        "id": "054",
        "grid": `恐利利惜杯水車水馬隆頂雷
                 飲井恃有新薪四通泄轟五風
                 民餓井改為心術達八不石互
                 不利羊有巢有不正名沉通火
                 聊不入緒條換順言大有為大
                 升從虎不干利貸海無光光是
                 投心紊軍全門走之土地明義
                 老石萬負物投可命包山絕滅
                 秘馬問沒無吐信羅密圖子孫
                 品主識路昂然萬師雀買馬徒
                 頭足先途手象失償價實齒長
                 論竹入為步斯得不高則得亡`.replace(/\n|\s/g, ""),
        "answer": "條條大路通羅馬"
    },
    {
        "id": "055",
        "grid": `四木及入樂無容間言謝外號
                 方幕三分洗信作不小恩千所
                 雲若招心工耳口法上施影裡
                 大落革八告市恭雌百面各器
                 血面晚七亂湖信聽黃獸講海
                 線流面懸若口發肌藍牙天雞
                 點具成面開小瘦利妙不可狗
                 滅神之河俱嫌手暴可狗飛專
                 原起智言刻到兩猜跳言口森
                 我蔑物不擒袖相凡替如森學
                 時示容來清力救陳往落雷精
                 余緩任風心從老生年談虎便`.replace(/\n|\s/g, ""),
        "answer": "跳到黃河洗不清"
    },
    {
        "id": "056",
        "grid": `銘骨刻屬拍堂案具望通赤住
                 千中景逆年兵虛棒者子橫無
                 揮股次心荒日中天之攔成及
                 似始即馬曠如全心序其心龍
                 四心亂事披神仙眷銘術欲圖
                 而永力終貫狼怡大不則下速
                 費勞院注棄虎驚正達可跨辱
                 據望時光共小皮天語挾一另
                 信理面自怪化入無列重入世
                 重能力上大陸倫事主率心分
                 處更給爭馬次離迷神蹤成長
                 生不手看回夢難惡炫行木迷`.replace(/\n|\s/g, ""),
        "answer": "子不語怪力亂神"
    },
    {
        "id": "057",
        "grid": `愛不子登五無我從伐筆口謀
                 及屋虛科遍體完膚一覽無遺
                 鳥有一此說麟投懷大山遮珠
                 知己起曲行傷送地火中擱之
                 知彼百折轉百回迂百樹海水
                 若百戰千迴春千一年人銀上
                 大勝間寸方曉呼千里瀉立花
                 方又一未然百三三地呆判舞
                 緣起波平諾日計兩無若木起
                 入木三分秋紅情里全上雞聞
                 空求折天色相人人下其守勝
                 門魚下共悅無為我不分美收`.replace(/\n|\s/g, ""),
        "answer": "此地無銀三百兩"
    },
    {
        "id": "058",
        "grid": `古往今來總角得千裡仇家線
                 道望年資交不藤工新一成牽
                 熱穿器具償築夢仇恨科相雞
                 腸秋金失台高舊大而畫之功
                 價隨魂因小恨此時估讀敗另
                 機落飲於之綿綿一攻垂求傑
                 魄便新入決無字雨成除舊新
                 能不骨心期千眼萬雨不佈歡
                 忍人滿銀金一籌千萬緒變天
                 意不能忍展變密山痕光縱醫
                 足涂蛇畫薪萬成不淪萬縱無
                 別出薪柴化學式不類格水縫`.replace(/\n|\s/g, ""),
        "answer": "一失足成千古恨"
    },
    {
        "id": "059",
        "grid": `合生安怒壽風南歡引欲南心
                 家席生比藏補影征專轅求不
                 百開南思救污新海北年積滿
                 多山濟柯出膚納轍討少東聲
                 咄皮不坦一百序垢勞多東成
                 必虎腹義川夢處民重擊善施
                 人東狼披之書傷數西犯初樂
                 床婿窗造門財輸之家子號一
                 乳圖謀事伊當每喻碩形捧蔬
                 原若方不發華戶是及水小心
                 漸斥取達規曉情對功大鹿擊
                 然幽賢詞意離輸局在社魚採`.replace(/\n|\s/g, ""),
        "answer": "戶納東西南北財"
    },
    {
        "id": "060",
        "grid": `路徒童旁內砲牆急跳西故辭
                 窮末然湊聲排江無中心三人
                 朝為回隆促代山有惑生難今
                 征三隆岸情可才倒有大智完
                 職器暮為美盛竟幸海欲入水
                 子晚土四不賺意撈及紅池嘗
                 葡回平墜三賜針神奉不歡果
                 紅八心以身入端貶通晨然失
                 穗戶市轉分得木興實廣星傲
                 穩若風日意門高別風力大骨
                 開三喜洋下采別浩門作風磊
                 泰氣洋末烈名投淚出洗浪強`.replace(/\n|\s/g, ""),
        "answer": "生意興隆通四海"
    },
];