// puzzles.js
const puzzles = [
    {
        "id": "001",
        "grid": `情機少其時太空原中是價門
                 勤事洛課常非行懷榮蓋無批
                 朗鳥在陽非想先華竹太之報
                 及發月人紙入富待華北保腦
                 密才時明為貴人之集王文率
                 人帶不主星接古當及班門地
                 大想費解物稀務物大無弄府
                 因卡司新之換以正地貴身替
                 報抱印年多類星貌咪海分細
                 果之家或聚化逢移取區義剛
                 器而與向天吉兇上碼人木訥
                 大晚成人之每天晚分分折和`.replace(/\n|\s/g, ""),
        "answer": "物以稀為貴"
    },
    {
        "id": "002",
        "grid": `彬兵冷億灰心情舉悲澆愁抽
                 賓千班無臉頭眉仇更眉苦刀
                 有裂軍不辛辣土田苦酸吮斷
                 理決之萬醒腦記臉留更水文
                 上不鬼神馬揠是龐人火便生
                 往新溫齒龍入苗心門徒故變
                 來家徒故經不不助看截在為
                 去增詞送知古黃敷長時一次
                 字取原所曲新天補出台影店
                 如敗措散人終短經手無水留
                 髮另文兵接相兵舊每金間草
                 大台老開槍一人快使美句花`.replace(/\n|\s/g, ""),
        "answer": "馬不知臉長"
    },
    {
        "id": "003",
        "grid": `瞭崗四心笑花學丈萬都林市
                 合臥亂方平裡治負器所零流
                 日如落大親入藏片豪屬叢離
                 麻週灑路不霞蒼刀行從心事
                 天木替上劍樂侯素光天祥故
                 店破不至命天始心花劍北人
                 風含清仁漏之直亂不試影西
                 題少社大斬口墜進終屢月詞
                 排不是草快釘樓水的棄得黃
                 樓恩除恩律朵截台如煙每賀
                 房根容不復否頤鐵魚登光濃
                 分急緩言刻不可置遙步之天`.replace(/\n|\s/g, ""),
        "answer": "快刀斬亂麻"
    },
    {
        "id": "004",
        "grid": `預風結急影無記以久日觸幾
                 雅完件顧字研聯出藉類重情
                 比神偏享旅各神似旁發出先
                 得志出做懷入角通部制不制
                 轉眾城鬼化喜般按廣任除戶
                 感日胎外沒兔出就人大足較
                 今逞千煙柔神五望人秀旺在
                 真當聲竅盛內曝野外是可礙
                 匹字處琴俱共剛慧線商目助
                 勇副喜焚煮舉中推辣話前首
                 有永入細可賀信享知米無為
                 磨到獲入重釋熟能聲巧覆男`.replace(/\n|\s/g, ""),
        "answer": "內神通外鬼"
    },
    {
        "id": "005",
        "grid": `薄雄才略郎謀心中荒景山同
                 慣兒生才易容身術霧力黃名
                 養驕女以間還有邊不片課盛
                 非貌子情人髮牙從甲正民容
                 天想切痛長死心不秀急緩豐
                 深急身目含網留水清故輕物
                 大仁中之交廣到名效穿狀重
                 事無補生死牽生大擾望及立
                 人列於得智會公一同人金人
                 手並兩驅欲無號固床小盟言
                 抱重齊三私岸貨大夢木異石
                 缺殘行家為界蓋興見土竹絲`.replace(/\n|\s/g, ""),
        "answer": "女大不中留"
    },
    {
        "id": "006",
        "grid": `牛虎質行需維四科舉月色僻
                 吳皮百費義羊力管迷暖殘望
                 喘宗聲無入倀不一處冷心傷
                 受平反虎能作除凡資知接岸
                 殼顧口惡背為離負夫煙青破
                 勝完水字提熊力尋找俗暗崗
                 兼人而雞歸蜂腰不逆雨子方
                 臥龍犬興交堂腿夸密承懈北
                 常不敗馬替逆狼理父在逅江
                 寧無外有之錯授業恩逐水一
                 典法天中忙勞母拜擅散日紙
                 恩開人吸磁臥皇求奉人稱傘`.replace(/\n|\s/g, ""),
        "answer": "虎父無犬子"
    },   
    {
        "id": "007",
        "grid": `力不重心人默藕吃風爭之口
                 挽動草催風命默斷吹一舌中
                 狂伸眠綿腿瓜關無蟲步嘴有
                 攔舌棉祥延世田天蚊蓮油目
                 不動無吹風外米李衣滑中無
                 打恥期日夜園代世下無眼珠
                 自絕下自投桃外和神量縫人
                 招情禁問僵桃心醫人功取貌
                 設絕不圓源達報滿殊途鬼以
                 想憶中無人太為李意為然輔
                 舞起雞蚊鼓患互出不足毛股
                 自不晾粒而危言聳聽駭人聞`.replace(/\n|\s/g, ""),
        "answer": "桃李滿天下"
    },
    {
        "id": "008",
        "grid": `矮胖受毫賢柴謎由金順心感
                 高市查降時降言亡銀每市凶
                 之戶井處出一命羊新馬無櫃
                 由頁大之足之徐才與天久死
                 小勞尾不徒買大略高仰九均
                 大自而債機碼大大大八九我
                 眼大規賭著五威名貓躲斗落
                 為頁地出易猛啷方鼎降去煙
                 選勞人力師區市方落鼎具竹
                 榮頭弄心要不關關欲琦各不
                 地不自吹點檢利不順逛出剛
                 花用老王瓜直你沼則望高德`.replace(/\n|\s/g, ""),
        "answer": "名師出高徒"
    }, 
    {
        "id": "009",
        "grid": `如髮衝冠河山林人誰能情皆
                 雪兵怒火吞同鳥非草無眾醉
                 星結中燒氣打魯莽恨木人我
                 光金禍連延火英行別鳥皆獨
                 負忍枝金良雄願事一驚醒兵
                 重辱科玉言不拘介感時心快
                 功胸有律葉盡不小花無之樂
                 不成無化用取之節濺人常選
                 必竹頑點之有道餐淚生十如
                 在海石頭墨不公自風朝之意
                 我成爛是所竭人在強露八九
                 金枯虎道能盡心石雨急宿快`.replace(/\n|\s/g, ""),
        "answer": "一枝草一點露"
    },
    {
        "id": "010",
        "grid": `不予求千豆瞪苗讓之招器大
                 木給於頭子敵竹火人兵美晚
                 暇目取萬芽人子軍千馬每成
                 雖勞於序言驚民鈞萬買賣天
                 心費師曲心不一力不罵量地
                 合神來動聊髮由氣心扔存不
                 筆至魄生眾耿耿衷呵如去從
                 夜做金庫襪新風聊虎成止土
                 日深組主愛平火添養兔火水
                 大快人新浪滔翼丁括惹草木
                 虎木含靜句天笑指花奏科土
                 好累類淚門之一曲大夜小前`.replace(/\n|\s/g, ""),
        "answer": "一動不如一靜"
    },
    {
        "id": "011",
        "grid": `無起大快仁欣肘力之雞負手
                 硬冰死快任新擊投苦萬辛千
                 涼荒不回人薪技法無皆腳手
                 品螞活口生心心相硬入知新
                 衷亂眉柳平龍號通情達書連
                 上七招氣暗鬼活勝相八理新
                 八一和箭斧花使虎逼四穩共
                 下表傷神無草明神太通半同
                 裡人工苦中庸之到差信費創
                 腦殘新入推心置腹半新神照
                 居端多記鬼移神疑勞斧犬連
                 之有能錢磨推有幸之馬鷹體`.replace(/\n|\s/g, ""),
        "answer": "疑心生暗鬼"
    },
    {
        "id": "012",
        "grid": `情方舉而在滿白欲由不謀圖
                 適原個規振手不宅包貴子無
                 訴顯有魚起筆起母平羅無貸
                 神惡得家如神疾秀知所萬換
                 通水破混經走後書不念斷象
                 天人之蛇由地達債俱改朝袍
                 亡於本龍掃禮出灰口可第割
                 幸固領風功紙登門雀羅席及
                 緣千若各醉過入車水以格好
                 男萬紫金薰風相室一碼投市
                 善紅迷天湯不機抵所其魚門
                 女福人齊是曠百失離留故若`.replace(/\n|\s/g, ""),
        "answer": "家書抵萬金"
    },
    {
        "id": "013",
        "grid": `其自言而田一倒甘道寅精采
                 來有食肥水魚兩蔗吃眼演出
                 人之做惡因碩食卯乾裡施西
                 欲四端多果十糧抹凡風扒東
                 出祥瑞僅報不淨夫獨流玉外
                 呼乎存應才繼俗儻個樹火銀
                 之一未甘德子之君臨天一花
                 新心拜兼備交佳風軍下三幟
                 天下心師教鄉相人交知千煩
                 風疾自用學長天識點頭口惱
                 馬相不格以藝下滿萬移接絲
                 牛及物知致術百緒就花木耳`.replace(/\n|\s/g, ""),
        "answer": "吃果子拜樹頭"
    },
    {
        "id": "014",
        "grid": `子師像風之大將天章文假大
                 凡俗大況力從心下牙一白地
                 秋穿望言入微子虛鳥般黑見
                 不洩水眼不敷出自有口無新
                 通四吞足欲慚棒堂忘利得見
                 八達道蓋至穿愧不義家義易
                 土雲彌想住吃知容破勇器棄
                 物彰話非和難辭人為獨風瘋
                 花水偉解而信亡所善難發發
                 落昨天退國其欲其惡任才文
                 興石家下負為身天下當敏絲
                 出和萬事人所間善任大節捷`.replace(/\n|\s/g, ""),
        "answer": "為善不欲人知"
    },
    {
        "id": "015",
        "grid": `子人凡秋不通百我三八土物
                 花落定興出師俗口無穿謝四
                 達雲張勝水昨小劫莫苦司貨
                 參業之中天於真覺地辯真藥
                 向不他新宜告有憑才價的王
                 武白是救一他尚無實往用為
                 瞞我望西自決礙打應據新軟
                 友易被資的原雌份八拔還住
                 受得紅大同華曉雄事家子人
                 風制以歸重人才半便在校真
                 頻與於所輩大功出假不人是
                 秋盡成人略倍將為張是無為`.replace(/\n|\s/g, ""),
        "answer": "事實勝於雄辯"
    },
    {
        "id": "016",
        "grid": `箭堂正正術心苦良心惜相心
                 雙一堂不藥良猿氣用別有心
                 成鵬帆而春口若意事汗水灑
                 對成癒風百河懸高馬不蹄淋
                 調風化百順依苦功對停汗如
                 順雨既一裡不勞措吳牛喘雨
                 雙四言表卑下手畫充月彈下
                 對馬出不相不上棟梁雕三琴
                 雙難亢追及子君拔不槍長短
                 對難分押猛義不入刀敬兵二
                 相解秒出兩虎馬虎人相如實
                 鋒爭必一舉得穴物接待助冰`.replace(/\n|\s/g, ""),
        "answer": "風馬牛不相及"
    },
    {
        "id": "017",
        "grid": `夢台商目川若主樣賜傲主先
                 築債光工海大納拙米一認入
                 高如淺魚落巧言勤弱諾自言
                 豆崩魚流農勞力不角簽欺雲
                 穩泰芳得案神禁稜慚分意鬢
                 相百駭牘水風雲留孤克囚魄
                 世惡廢人行不由陋不救劭目
                 軒仁替待聽徑寡欲所堪集謎
                 逼齊研放舉聞開院秋吹一告
                 咄裡視器苦雨言門差針可擊
                 見笑師臨有水難濃見羅雀全
                 廣刀藏高指昂於血清山杉布`.replace(/\n|\s/g, ""),
        "answer": "百聞不如一見"
    },
    {
        "id": "018",
        "grid": `魚江微中整日自大炫春進狀
                 仇敵濱不使期先危言聳義末
                 同家慨訪足發聲人聽不黑可
                 決嘆破勉制道綺奪容耳慚萬
                 待物為人堂禮貌辭勤能補濁
                 接其姿觀亡上商岸對有力貴
                 難響驚破止哄笑網然心分非
                 義測膽節豐秀雷容滿如海陶
                 毛雲顫無外衣指意可止處進
                 骨聳色慧天生足生意外菊水
                 然變中薄戶所枝食先台焚討
                 容失虎措手撥生體調牧粉鶴`.replace(/\n|\s/g, ""),
        "answer": "不足為外人道"
    },
    {
        "id": "019",
        "grid": `難詡惑反不成下記臊地查粗
                 為知儲類伏無天預高彈犯丸
                 事暖欲狗化虎關深石體通持
                 師問虛寒各樹莫沉度力兼容
                 貪用熱一天測大逆少行至並
                 自生方縮後海千招之黎鳴資
                 以正怕入竄秀世催風交樂斥
                 為是負死節基界天屢藍序地
                 非連人哀於光田劍記停田秋
                 非拓順心鴻非及密日海中豪
                 人變不展不遍命中如色太無
                 想忍曲非是古野號七角狼范`.replace(/\n|\s/g, ""),
        "answer": "哀莫大於心死"
    },
    {
        "id": "020",
        "grid": `有小無中有由勞之慰烏烏倚
                 一名大恃生拍案叫絕鳥合不
                 吃驚無名七步牘處一技之長
                 不恐秋實葉不逢人而黔眾短
                 成語一果因生鬼惆途驢口爭
                 接咫兄作時帳我甚半扣舌燦
                 跑尺龍因虎不咄咄逼人為小
                 怨天尤人異同技兵甚心太財
                 角涯地虎冤床窮黔弓弦死相
                 一海作家夢憤驢鳥之盡得兩
                 之之路不拾遺離福藏人所看
                 含窄逢一步失不禍倚其厭壓`.replace(/\n|\s/g, ""),
        "answer": "天無絕人之路"
    },
    {
        "id": "021",
        "grid": `裡表一來人君天臨有有年心
                 面里不之置不渴下色聲動不
                 離鄉貝井酒掘可藥欲薰期惑
                 白小新上井花有墳救而處藥
                 血骨如添花有貌墓遇不變到
                 換流山明直理條分求眾驚命
                 湯課成十知秋毫明怒換弓除
                 不十年河年故無難偷大支入
                 換之前望東合犯墜天拖鳥欣
                 我們勢朋穿獅西日泥特寬然
                 有時年之後秋吼帶起脫衣欲
                 到找也在們我水送行解帶睡`.replace(/\n|\s/g, ""),
        "answer": "井水不犯河水"
    },
    {
        "id": "022",
        "grid": `傷千畫略謀無禮尚桃連完無
                 心天鈞財舉互往來李晉弊情
                 地良害一珠不通不面之規有
                 人命反理髮王勇有利交照唯
                 關三退勞買之難人無慾無價
                 天難型案瀆色天才華傷薰逃
                 義之流珠環膽百武洋役大心
                 二冰三芳才發歡公髮工之雅
                 是壞傳鄉百樂家皆則需有而
                 傳門出中死世合臻每求過有
                 千不不拼者密國地一環怡所
                 裡外不是罷前為家保家居不`.replace(/\n|\s/g, ""),
        "answer": "有百害無一利"
    },
    {
        "id": "023",
        "grid": `術獨飛雲兒闊掏刀斧班龍大
                 數當奔盡弓生土望破爭拓國
                 處一兔鳥藏三揮聞虎色變沾
                 是面數狗心諾細鬥朋堵務岩
                 一促縮二音千路零懷緩當輕
                 剛逐意物窮容金高水才及身
                 言是駐敗光山宛凹漲船不巧
                 往成族煥明木惡在萬由弄遇
                 記晚發水地起一水己做一逢
                 可器秀戶做價入石層心救虎
                 握考色這過按戰生二記盼瀑
                 秀查起睡復騰消用逆鳥切騎`.replace(/\n|\s/g, ""),
        "answer": "一山不容二虎"
    },
    {
        "id": "024",
        "grid": `難的愛拒理仗狗人世幸金涼
                 孤枕抱狂猖郎勢雨言童慾之
                 眠棉匹神亂舞才欺玉配腹口
                 飲布鬼說劫者貴女人記是訟
                 隱瞞事實濟富賤自貌心分心
                 皆眾天俠盜貧困各非頭不違
                 知所倻過賊大由之難臨雙古
                 惜物強將海想小破斷禍半道
                 相一大撈行大井鏡釜簪徒樂
                 線穿針千千萬氣底廢而白腸
                 相到一見花熱抽重之邊木子
                 知連輪滿血薪好圓花蛙耳湯`.replace(/\n|\s/g, ""),
        "answer": "女人心海底針"
    },
    {
        "id": "025",
        "grid": `身庖有始鐘咳不容緩心隨寓
                 身不丁如一心一話不份安而
                 息欲衣解藝語成在守至勿毀
                 建人地之牛識焉下已剩人人
                 好斧闊刀大衣悔不藉癬子不
                 色班門殺槍默對捻詳屍弟倦
                 之弄身旗雞不默泣而義還甚
                 塗之張鳴疤取入無氣博捨魂
                 禍多狗鼓大痕卵用蚊雲師芽
                 多盜功震眼材事草天心寄天
                 打敲鑼喧高主小木自龍是單
                 擊少天地手低心用皆賓弟虎`.replace(/\n|\s/g, ""),
        "answer": "殺雞焉用牛刀"
    },
    {
        "id": "026",
        "grid": `屋勞心勞利籌見日久玉井馬
                 需不萬漏一畫心心樹井旱拍
                 子辦中無成事不臨有大逢迎
                 無毛上臉成足風條亂餘招想
                 份恐有華畫蛇添愁愁七悸風
                 不天不頭蝶引風眉八大之中
                 官武地入有蜂苦下上道行下
                 死戰吉有萬臉頭面是圖為天
                 文官危人正羊大其手關師與
                 諫死空為天器質過制真虎人
                 司巷直田在相庫虎國謀報易
                 其非斥中事為至恨皮王小罷`.replace(/\n|\s/g, ""),
        "answer": "人有臉樹有皮"
    },
    {
        "id": "027",
        "grid": `假真力量見而為有比繳協見
                 影不量田無法無守壞力義信
                 設自在龍槍而自能守勇新勢
                 撒推三揠不入得望為價均封
                 含逆少思苗到相食前力動原
                 影到光去刀助古無敵身不兵
                 見行光天雙不長處是先士卒
                 下失刀風化無以一檔千守人
                 天小得方雨日我捨推法如惡
                 上變雲一水無騎三乖報指髮
                 天色風回在佳阻誰是張消格
                 幫點春頭望四口可處資智物`.replace(/\n|\s/g, ""),
        "answer": "化阻力為助力"
    },
    {
        "id": "028",
        "grid": `玩完體入家膚長如自森所風
                 人日風出良命無法地放月花
                 格閱愒吹百地天紙無雪中一
                 物致知歲草品不改上矢送得
                 天盡徹心欺動頭加牧談馬洋
                 揮下寒人聲換霜論服舊兵怒
                 驚金太色面物墳祖足宅從不
                 大甚如平水孤毒墓土大興力
                 失色名土盛而來野村俗子怪
                 耳聞不詳道世僻有夫凡不語
                 人服詳願遠中逐鹿資住開花
                 舊人文雅匹夫之勇市資春暖`.replace(/\n|\s/g, ""),
        "answer": "太歲頭上動土"
    },
    {
        "id": "029",
        "grid": `犯豪門天中如欲油多七門恨
                 記人女當看用日秋嘴市庭商
                 耐賽留中戶開人八碩滑可國
                 單尋人源結對舌目僅羅舌月
                 位成事心牛力果及無慎雀指
                 三肥珠彈不無車出人全鹿吳
                 無而琴從虎古人水久為牛露
                 免言心皮火頭枯常馬喘可修
                 狡信謀圖地樹蛇釀月龍一餐
                 軸與瀑土力行銀尾毫揮相風
                 敵寡逢田替威道華唇依取宿
                 窟眾合天秀道重任寒亡齒然`.replace(/\n|\s/g, ""),
        "answer": "牛頭不對馬嘴"
    },
    {
        "id": "030",
        "grid": `器晚慶丹清夢色持及不載備
                 成貴墨躍井關盈琴合歌繁族
                 普天同國論保品論舞而語狂
                 透縱意酒泰英啟名天羽補翼
                 束港虎組丑民落地下關人名
                 駛率農歸眼孫安一行捉花貝
                 樹效村明山高心風代有扇極
                 探鄉手目粗照手老主月餘地
                 魚快田野不活馬低個刺具力
                 百族加宣曠識細曉情是無征
                 長使開翠途夜丁泰非寫屠夫
                 列正懷綜合治直達生手賊駐`.replace(/\n|\s/g, ""),
        "answer": "有眼不識泰山"
    },
    {
        "id": "031",
        "grid": `大照裡使大器停序來狼其床
                 晚之留為粉住特全沒告主落
                 空零短身力救力不軍沒過碼
                 人所碎有敗以中可家覆弄來
                 幽骨有朋赴名女故亂狼沒趕
                 欲之無順帶卡裂是人經幫新
                 不到到忍手一生狀科千是和
                 指機失幾遠牽舉紅鈞持勞軸
                 與染方常強入羊一素師黃於
                 爾藍乎附冠衝髮怒動撤欣賀
                 而慣會樂智贏到眾畫計升為
                 貝講西密與逆洛葉捨炎火抗`.replace(/\n|\s/g, ""),
        "answer": "牽一髮動全身"
    },
    {
        "id": "032",
        "grid": `士釋使色聲不按重損患滿圓
                 視式室風吹動不兵人人心得
                 事市逆相草木折老滿滿利功
                 示世惜來得將當受意謙為己
                 勢一不生順益損足招過戰患
                 難求花生壯受彰益六五一站
                 幾得受枝謙託制關匠至者心
                 知易人謙招沖記於是三穿湖
                 難買君兵全展自是人面末九
                 金子買查福新清牧種毛不可
                 千馬愁引新摘成是一拔寧人
                 瞻是首小大下次無霞是席息`.replace(/\n|\s/g, ""),
        "answer": "滿招損謙受益"
    },
    {
        "id": "033",
        "grid": `得意器風發容始骨血各弱製
                 洋化口入水機元相殘肉撤之
                 灑權授火天倚一者強爆橫理
                 人庸之時予絲老食相肝無飛
                 大中義支不失得賣膽義情虐
                 法禍財掛羊炭濁友老照無殺
                 大從臨入一質清求成當天行
                 工入虎頭狗漏虎榮持機益行
                 化口掉尾頭仗萬皮種毛是狀
                 原前續再輕是人肉待賃出原
                 不貂喚心軍稱道勢記風必會
                 意尾散染牛職地欺葬雲有因`.replace(/\n|\s/g, ""),
        "answer": "掛羊頭賣狗肉"
    },
    {
        "id": "034",
        "grid": `大匠鰻身依舊在幾度夕有見
                 之烏心落昏機可失陽口大風
                 風合秀獨臼迷山窠皆夢落插
                 運之排擠運轉不碑初大大針
                 轉眾志成成道流醒昏方歡皆
                 議紙城賠償離途聽說義上喜
                 見上醉時所失骨我長氣眉稍
                 縫彈生金不丟行杞到用苗樹
                 轉兵夢義迷我人長短事見見
                 舵畫死氣素憂予現鬼人縫風
                 威下馬用天上鬼間眼窠轉插
                 風搓卒事地上人人間臼落針`.replace(/\n|\s/g, ""),
        "answer": "眾人皆醉我獨醒"
    },
    {
        "id": "035",
        "grid": `勉共左小俱面伙放人殺殘相
                 勵為右纏到面伴處畫地語自
                 眼手其鬼有成石龍雜餅自言
                 明到擒難左金點飛鳳蛇充限
                 去來色色右晴爭誰舞龍耳飢
                 自者不形為鋒與假蟠有不聞
                 如具拒形對相威虎無勇起雞
                 來連銷影不撓踞狐謀既舞隨
                 什骨相不屈草憂果花皮翩風
                 立於肉另離食忘結開金翩流
                 旦一飯相而廢寢肉城石凋落
                 千金眼看殘不綻所致為儻水`.replace(/\n|\s/g, ""),
        "answer": "畫虎畫皮難畫骨"
    },
    {
        "id": "036",
        "grid": `都包星棋肝膽相造氣見義勇
                 市天羅布吞下山上風吞仁為
                 恐一感萬海氣欲雨滿雲山讓
                 怖無師自象雀大來樓吐以河
                 病奉通萬中屏中快語霧裡敬
                 打快千千大選心扣人快弦如
                 易草熱牛方表一心弦心帶實
                 取因驚鬼畫裡不意相戶福持
                 同最身蛇扣古味一天印無豐
                 工知添深無宗色俱而醫衣法
                 之足臥裡藏古身全不足無地
                 妙校裡藏刀底香有食之為縫`.replace(/\n|\s/g, ""),
        "answer": "人心不足蛇吞象"
    },
    {
        "id": "037",
        "grid": `鋼壁投瘋誰爭孔厚非非入享
                 銅鐵坐雨風外仙此妙繆靡一
                 值其享吃理爬草柏筆青罪騎
                 不成醋見山開早賞丹二屋愛
                 文一相心門空花花罰集汙夠
                 怪印心敬把前天不色分壘狠
                 小大而轉如酒亂天之快明魏
                 驚遠逆勝地賓言喜舌口出爾
                 之近分不飛臥完歡地齊煩有
                 下上堪聞道道虎自璧厭不強
                 以一不問斃龍藏璧小的萬格
                 擊卵石醋多刑不以此使年傳`.replace(/\n|\s/g, ""),
        "answer": "敬酒不吃吃罰酒"
    },
    {
        "id": "038",
        "grid": `修七幸患秀燻酌弄無行真劍
                 生午如茫然外亡過巧圍大重
                 身養刺魚圓一慧鏡農言詞盜
                 有犒心內得新花中拙以其鋒
                 背快方大負水勤能食先利假
                 助心驚水月古千言者必力滄
                 動人落為環故而膾多勞海私
                 魄石器井天肥炙瓜民桑力談
                 出昂宇晚下人燕店田不淚塗
                 手宣記密口石之瘦從李聊如
                 闊營為克水欲平心共雨下生
                 張步劬審劍腹鳴魏化整炭靈`.replace(/\n|\s/g, ""),
        "answer": "肥水不落外人田"
    },
    {
        "id": "039",
        "grid": `吾愛舞浩康忘乘離生頸吻天
                 學浪跡天涯子龍死之交之握
                 以得鳩引忘梅關別花驕懷愛
                 緻虛佔止渴頭開如子儒慷武
                 用名雀忘頭面生虛抹家思妙
                 結外朝是蓬垢烏漆似黑手身
                 心生道同美有金不堪回首異
                 如枝人物玉碧霜玉春處為人
                 偷天換日輝餘不冷滿方虎師
                 心星溢煌芬打罵寒身堂做表
                 移右尚芳自情俏冰而戰帳心
                 慶砍氣招坎婦巧時空慄用自`.replace(/\n|\s/g, ""),
        "answer": "浪子回頭金不換"
    },
    {
        "id": "040",
        "grid": `港樂焦母拋伯常信和啼舞雪
                 角護離遷剛頭經人盡閱鬼破
                 替透口孟頭總露情一本奏上
                 紛貨無是物田本面心塵取獲
                 方物道家心以交山一裂不物
                 兩銀破於可非類改意白歸染
                 景人下時天歸含聚之懂得賀
                 亡落夜我情伊笑冤沙辰映竹
                 麗雅無生有老談風昭成洗環
                 裔大死野天生常成治雪塔裡
                 厚燕牙有若中道家桃裡報投
                 宴研御俠塵田幸七偷助舟飲`.replace(/\n|\s/g, ""),
        "answer": "不是冤家不聚頭"
    },
    {
        "id": "041",
        "grid": `萬傷人得奉順無帆水渠順成
                 年五天石設添水碩風到得仁
                 體獨戰害白下生人欣不古善
                 厚額寄頭理離遠營情千如欲
                 投謊偕屋美恩開外髮有一魚
                 肆老漏虛子趨游願步釣可形
                 個辯馬胸難刃之登口力敵原
                 形名才識有君人若天特勢井
                 新維無餘途成懸云鶩不欺下
                 有不礙刻刀河竹書亦賞甚水
                 有所散骨花牛銀樂敗云落太
                 好幕志銘火樹乎皎招風癡失`.replace(/\n|\s/g, ""),
        "answer": "天若有情天亦老"
    },
    {
        "id": "042",
        "grid": `落睡花費版案勞型望成龍大
                 輪成反貴耿憤現賣碩子快婿
                 不畫生原心初行品投人承坦
                 類替蛇忠狀大頭騎心試膽複
                 寧挑刀添言論好有居合小東
                 子息伴不足妥餘樂安家大床
                 虛孔慚界勞悸華音定規秀使
                 孟母武君胸而據咄繞花腿欣
                 省三簽有不理獲所逼樑拳榮
                 市人成實力未人任下至敗歸
                 信竹成爭開擋經淚如重屢戰
                 難騎虎膛臂言車雨遠到凱旋`.replace(/\n|\s/g, ""),
        "answer": "心有餘而力不足"
    },
    {
        "id": "043",
        "grid": `才負翻未瀑到掏費湯新帶夠
                 文思雨雲定在敗功貪無相人
                 荒綢敏路以之成人木生降是
                 繆一類捷緣身天勝定兩怕種
                 爭步足面退份作准人等寸死
                 天先箭面邊多事則的中不水
                 登原恐怪耐磨好至號足落面
                 動相興後勞不而華惜石花皆
                 人傑零師間時西在出家溫章
                 搖地動貧問東混愛天人保凱
                 喜眾創作窮罪對談吉相意一
                 不敵寫新聲談牛勤老才人表`.replace(/\n|\s/g, ""),
        "answer": "出師未捷身先死"
    },
    {
            "id": "044",
            "grid": `海幣四徒家鶴寒安拆河暴欲
                    為固志殊立松貧凋於橋無虎
                    家大若同揮樂強博辛所思逢
                    故田之金道行替人不層圍騎
                    招步如當湯合群知所防虎思
                    自土齊言黨成萬天書難耳香
                    夜一招以之紫結間下達花念
                    情大當兵千過軍髮容日禮頓
                    利事樹紅買方早萬依鳥太義
                    洗逐渡櫝期馬百出負語揚綽
                    貧降還任耐尋市計晚餐有奉
                    如珠天孟舉人位市素歸規餘`.replace(/\n|\s/g, ""),
            "answer": "千金難買早知道"
    },
    {
        "id": "045",
        "grid": `柳暗花山困潦倒眼青天飛一
                 窮村窮窮韋混蛇龍中黃中語
                 惡水末途雜編新雨騰的不慌
                 盡見路小末大三達難虎纜接
                 金不家見英路略決死文閱群
                 平碧黑參雄才敏捷思擇法書
                 玉光輝案含笑九泉噴蒸無編
                 生之續煌敦善湧噴蒸貸天旁
                 自勞初身怕欺奇日項款無居
                 前甘泉碧潔惡上型下效高天
                 步踱墮由自愛不瞞君臨嬌皇
                 徑行不落窠臼釋手下子之遠`.replace(/\n|\s/g, ""),
        "answer": "上窮碧落下黃泉"
    },
    {
        "id": "046",
        "grid": `一日心頭一徵博引君入敷出
                 秋三上喜當旁為以人甕虎口
                 燈更人三百尺戒云學入美不
                 火口申虎竿頭亦疏淺羊勝收
                 難五成生虎云可言人人得志
                 令更財風生雲畏百出小在夜
                 難有死泉湧起萬口莫必夢日
                 道塗口良報雄卷辯得有行所
                 聽說舍皆師書萬讀迢千我思
                 我行我素碑益會路里迢師得
                 他上其與以文友多雙全全志
                 手下誰爭鋒直諒文武心意滿`.replace(/\n|\s/g, ""),
        "answer": "三人行必有我師"
    },
    {
        "id": "047",
        "grid": `我形我塑孤露寡蚊無默默出
                 不影影約約芳寄不雞徹過人
                 藕相不不勾人自仁敵起恐投
                 斷付上約籬薪悅賞離種舞地
                 蟲之丘下兒有豆德心下有下
                 蓮一有貉到童志餃高悅力鳥
                 住效無求井在凡靜匹望目語
                 居無訂所必底婦夫成夫重花
                 飲禧蚯得有應之品俗心之香
                 餓薪壕不接勇事蛙長子天泳
                 羊蛤燕腸口說無憑品學皆憂
                 膳麵飯淫碑話成謀有求必硬`.replace(/\n|\s/g, ""),
        "answer": "重賞之下必有勇夫"
    },
    {
        "id": "048",
        "grid": `諄乾先不洞商先同紙濟共孤
                 誨為甘禮亡知知上行鄉重執
                 敬示餘綽後燭談餐盛將注犯
                 弱倦小刀女兵為咀計命就愛
                 貪不今一試術詩就位寄不木
                 召淺禁游落高計其人釋思深
                 賓龍翻風然井枕籬手知積熟
                 賣先力舞外悅下無心長技慮
                 驢潛獨強如誤寸石憂處氣生
                 記兵中無人鐵大久滿信年巧
                 窮乾火術得所所時氣百不婦
                 滿義必術得久難登米無生為`.replace(/\n|\s/g, ""),
        "answer": "強將手下無弱兵"
    },
    {
        "id": "049",
        "grid": `不蹈機琦百花暢各記新主小
                 可火會年好誓去所字為有大
                 師山樹無合死如求欲其所歸
                 鬧人火銀月如不蓋不言百四
                 養中地此花歸彌叱於時如一
                 碼負取地圓彰記時吒撲帆記
                 翻來之靜瞻顯後不張風碩的
                 師出然了觀出嘆依順淡雲使
                 新身師一目其百為理風炸望
                 敕先大不威脅變具觀清梅山
                 見死識體利益萬念揮止如心
                 庖丁不太誘薰化金渴水土福`.replace(/\n|\s/g, ""),
        "answer": "樹欲靜風不止"
    },
    {
        "id": "050",
        "grid": `感石胸地外旋合夸幾果門古
                 形日補有同方落告父碩趕可
                 落水口約成促破慈渴逐雀羅
                 出皆而自落竹子望水刻日名
                 碑找具大圓孝投網漲舟及勤
                 件首驕終難其志傳記求劍屢
                 怕聲示兵所在說高萬成沙積
                 調消匿好必鼓樓誤丈銷渾提
                 雕擠跡得軒敗平地人新望點
                 紫針宇器昂授在起嘔子血濃
                 鬼幸似兒麟畫勝握成利弟於
                 迷生獲喜具藏卷龍經濤水發`.replace(/\n|\s/g, ""),
        "answer": "有其父必有其子"
    },
    {
        "id": "051",
        "grid": `糠曉破媚皮身庫先珀琥橙粥
                 屍儲號素心斯能人入克各求
                 婦溼外如畏言世亦雲為週見
                 最最家珍善謀秋雲其有主外
                 新新破道數彿面主勇小聞姿
                 研出人大中不腐無橋水膩姿
                 花品王昭約落謀汁血股堆肥
                 斗斗風而東姿姿而鹽澀季不
                 敏囍同新鞋力息倔合就網一
                 曝薪危病重息按嗆明里敵可
                 蕪格搖尾相眼我煙落花無世
                 飯麵丐關乞憐亂撩苟炘豆餃`.replace(/\n|\s/g, ""),
        "answer": "道不同不相為謀"
    },
    {
        "id": "052",
        "grid": `習從過如蒼天容間竟鳴一事
                 克以遠自息人一髮未話壞存
                 剛柔為若之事無名天卒碩信
                 入機方常無竿寧國大美果演
                 病不情成上先引人況採不僅
                 溼泰身日兩不禮人欲下散人
                 乃斥賀敗有力春後入招定善
                 窟文俱容名心得洋兵勝多主
                 狡傷乃題相裂家買天意惡其
                 兔大安武映財馬喻校引各為
                 誘黃雌口萬照直上戶合東人
                 兩雄是貫信揮暴虎逢曉到至`.replace(/\n|\s/g, ""),
        "answer": "勝敗乃兵家常事"
    },
    {
        "id": "053",
        "grid": `勇田現勝望憂力倒一不理行
                 熊往價心古屢過置之南逐表
                 重府直處度末本河自贖勞而
                 芳口勞前樓語棄命拆強鋪大
                 快式下馬臺水清戲序橋不無
                 僕大難月到高築井造水當息
                 遠于禍渠光成設路漲星任道
                 竹塑成臨發恩功船有披貌之
                 界大骨團頭此高肅堅岸靡絃
                 比田至破東事使出然砲告音
                 避日血風放斥水斯擊起利外
                 舍流當退午滴穿石落放敬地`.replace(/\n|\s/g, ""),
        "answer": "船到橋頭自然直"
    },
    {
        "id": "054",
        "grid": `恐利利惜杯水車水馬隆頂雷
                 飲井恃有新薪四通泄轟五風
                 民餓井改為心術達八不石互
                 不利羊有巢有不正名沉通火
                 聊不入緒條換順言大有為大
                 升從虎不千利貸海無光光是
                 投心紊軍全門走之土地明義
                 老石萬負物投可命包山絕滅
                 秘馬問沒無吐信羅密圖子孫
                 品主識路昂然萬師雀買馬徒
                 頭足先途手象失償價實齒長
                 論竹入為步斯得不高則得亡`.replace(/\n|\s/g, ""),
        "answer": "條條大路通羅馬"
    },
    {
        "id": "055",
        "grid": `四木及入樂無容間言謝外號
                 方幕三分洗信作不小恩千所
                 雲若招心工耳口法上施影裡
                 大落革八告市恭雌百面各器
                 血面晚七亂湖信聽黃獸講海
                 線流面懸若口發肌藍牙天雞
                 點具成面開小瘦利妙不飛狗
                 滅神之河俱嫌手暴可狗飛專
                 原起智言刻到兩猜跳言口森
                 我蔑物不擒袖相凡替如森學
                 時示容來清力救陳往落雷精
                 余緩任風心從老生年談虎便`.replace(/\n|\s/g, ""),
        "answer": "跳到黃河洗不清"
    },
    {
        "id": "056",
        "grid": `銘骨刻屬拍堂案具望通赤住
                 千中景逆年兵虛棒者子橫無
                 揮股次心荒日中天之攔成及
                 似始即馬曠如全心序其心龍
                 四心亂事披神仙眷銘術欲圖
                 而永力終貫狼怡大不則下速
                 費勞院注棄虎驚正達可跨辱
                 據望時光共小皮天語挾一另
                 信理面自怪化入無列重入世
                 重能力上大陸倫事主率心分
                 處更給爭馬次離迷神蹤成長
                 生不手看回夢難惡炫行木迷`.replace(/\n|\s/g, ""),
        "answer": "子不語怪力亂神"
    },
    {
        "id": "057",
        "grid": `愛不子登五無我從伐筆口謀
                 及屋虛科遍體完膚一覽無遺
                 鳥有一此說麟投懷大山遮珠
                 知己起曲行傷送地火中攔之
                 知彼百折轉百回迂百樹海水
                 落百戰千迴春千一年人銀上
                 大勝間寸方曉呼千里瀉立花
                 方又一未然百三三地呆判舞
                 緣起波平諾日計兩無若木起
                 入木三分秋紅情里全上雞聞
                 空求折天色相人人下其守勝
                 門魚下共悅無為我不分美收`.replace(/\n|\s/g, ""),
        "answer": "此地無銀三百兩"
    },
    {
        "id": "058",
        "grid": `古往今來總角得千裡仇家線
                 道望年資交不藤工新一成牽
                 熱穿器具償築夢仇恨科相雞
                 腸秋金失台高舊大而畫之功
                 價隨魂因小恨此時估讀敗另
                 機落飲於之綿綿一攻垂求傑
                 魄便新入決無字雨成除舊新
                 能不骨心期千眼萬雨不佈歡
                 忍人滿銀金一籌千萬緒變天
                 所意能忍展變變山山光縱醫
                 足添蛇畫薪萬成不淪萬縱無
                 別出薪柴化學式不類格水縫`.replace(/\n|\s/g, ""),
        "answer": "一失足成千古恨"
    },
    {
        "id": "059",
        "grid": `合生安怒壽風南歡引欲南心
                 家席生比藏補影征專轅求不
                 百開南思救污新海北年積滿
                 多山濟柯出膚納轍討討東聲
                 咄皮不坦一百序垢勞多東成
                 必虎腹義川夢處民重擊善施
                 人東狼披之書傷數西犯初樂
                 床婿窗造門財輸之家子號一
                 乳圖謀事伊當每喻碩形捧蔬
                 原若方不發華戶是及水小心
                 漸斥取達規曉情對功大鹿擊
                 然幽賢詞意離輸局在社魚採`.replace(/\n|\s/g, ""),
        "answer": "戶納東西南北財"
    },
    {
        "id": "060",
        "grid": `路徒童旁內砲牆急跳西故辭
                 窮末然湊聲排江無中心三人
                 朝為回隆促代山有惑生難今
                 征三隆岸情可才倒有大智完
                 職器暮為美盛竟幸海欲入水
                 子晚土四不賺意撈及紅泄嘗
                 葡回平墜三賜針神奉不歡果
                 紅八心以身入端貶通晨然失
                 穩戶市轉分得木興實廣星傲
                 穩若風日意門高別風力大骨
                 開三喜洋下采別浩門作風磊
                 泰氣洋末烈名投淚出洗浪強`.replace(/\n|\s/g, ""),
        "answer": "生意興隆通四海"
    },
    {
        "id": "061",
        "grid": `一部天鎮小晚器任尋群度仁
                 蓮不一程褒時穿金成碩成藏
                 不欣山貶滴食了電指義不容
                 華依身明古滴失了光量意詞
                 蘭意人不水離其所無石達昨
                 所有化穿由秀留頭好牽火於
                 虎思石書洗己親得工上掛言
                 旗易成狂平聲當準加朝見克
                 鼓遠奏易告抱名油無死村紹
                 者斬近先輝廣薪遠不上仁機
                 後人狀馳容兔弗救播股幾裘
                 價高報寸名屆許簽火奪其論`.replace(/\n|\s/g, ""),
        "answer": "遠水救不了近火"
    },
    {
        "id": "062",
        "grid": `一到以命業荒最力從心力誰
                 名聽貌伯經於危翁不號碼捨
                 驚圖娶如於嘻處在為從其我
                 人說人紙勤記焉所旦定心處
                 真救化漁醉塞欲一欲夕新聽
                 見死不生翁金為笑率未語情
                 活醫夢失真得迷置定性蠻緹
                 當死馬一借逢利之良新恨其
                 常插縫見意酒天地故人不馬
                 針轉風亂池孤澆知遇見流路
                 舵舟情肉火魚行愁他九情搖
                 航迷林大森水之米鄉日力之`.replace(/\n|\s/g, ""),
        "answer": "醉翁之意不在酒"
    },
    {
        "id": "063",
        "grid": `之始大器金若固達無大開筆
                 作降亂湯患切膚因才門振疾
                 天墜欲有得之失小見高滿薄
                 患合口患口痛用山不窟八草
                 得皆機務心無盟回命狡兔斗
                 碑目首疾比海心水取碼三死
                 託批中江誓以掉立落而烹狗
                 鄉向河無郎費親不身石代別
                 情日所相人才土新相罪出之
                 下家賜外書老盡安羔心日王
                 愁原套達有力珠羊裁故存戶
                 負妥內方四勞信黃寒竹齒足`.replace(/\n|\s/g, ""),
        "answer": "江山代有才人出"
    },
    {
        "id": "064",
        "grid": `房苦放送頌固若舟刻受金信
                 尋虎歸山金劍求洗制骨外育
                 知任兼雲湯出心於直得銘美
                 處竹重動雨革人雙支道本心
                 銷謀深源面善多頭果持直細
                 昏心終保引目意田地口水博
                 佑果術護目明全晚快投號欲
                 子天保不知合間非五體連求
                 布瞞見故正人慣全木親年其
                 觸睫犯剛似磨善悠入詳晚使
                 碼於蒙下千前車任花方規初
                 一吳鹿指親萬之鍵至舉圓完`.replace(/\n|\s/g, ""),
        "answer": "知人知面不知心"
    },
    {
        "id": "065",
        "grid": `人愛搗金業直掃人滴胸有弟
                 見人屋報狂入吃入亂水恭水
                 唱藏人及腿抽張脈寫噴不不
                 嬌法立如烏夢改全概偏以漏
                 鋒衝烽自訴訟巢找不旁洞莖
                 思剛套火風堵換倚其百精天
                 自復價值連城貸無出望慾蒂
                 佣天外未人天攪顫左冰涼溢
                 外方有裡雨後春筍青右顏左
                 夙夜匪懈冰綢濃千載難逢冒
                 殺譚玉碎冰削繆漏痘百粗源
                 慾睡穬蕭蕩頭棒呵含腥乳苦`.replace(/\n|\s/g, ""),
        "answer": "屋漏偏逢連夜雨"
    },
    {
        "id": "066",
        "grid": `牛女大帶遍藏新密門無窟天
                 晚握時無還一天物逆大柔下
                 界活能商孔有恩翻落戶盜全
                 師為細成必不報漲地井軍天
                 力戰工為之牙入處母覆下假
                 細體龜成鳩列火答沒無秋石
                 兩百無造名佔惡角雙原殺頭
                 情三動完口西鵲號傾雞素以
                 談置好舌膚故以巢取替緩演
                 對如之封不勝而卵誤大演勤
                 初爭有不稗出鶴斥擊輸力欲
                 末望鐘點理使可熱力石不縱`.replace(/\n|\s/g, ""),
        "answer": "覆巢之下無完卵"
    },
    {
        "id": "067",
        "grid": `銖瑺字無物星移未共無完受
                 必璣字歲換盡心來創體膚父
                 較天友三寒有其自剛運時母
                 書難竹罄其自來用愎來不艱
                 生不容從力食心命運懸濟世
                 面迫相心不良共轉大壺貽江
                 相面印心苦血同落啟笑傲湖
                 覷必俱風手下氣落大非沙積
                 擒先仙到國留情方落塔少禮
                 王賊擒骨衛仇竇初剛成見多
                 家來法有國保家開多是多人
                 法有家國骨入之恨舊新怪不`.replace(/\n|\s/g, ""),
        "answer": "書到用時方恨少"
    },
    {
        "id": "068",
        "grid": `顛皮虎鹿謀在位尋人老倚樂
                 質入心口補牢望裡心耐塊大
                 羊滿平術信飢山去輸如朵省
                 枕割太口不手作吃虎院止號
                 於旦開擇變正拈添談運江水
                 毀河食罄湯若翼來手院目福
                 賢帶秀起竹固金賓色無風瀑
                 選道始後苦難主知全湧寸起
                 與人其甦負盡書牛和逢巧鐵
                 帶器之所歡達甘下處巧相重
                 星晚然當禮石月來不相河作
                 披母由行出留水落花虎暴馮`.replace(/\n|\s/g, ""),
        "answer": "盡信書不如無書"
    },
    {
        "id": "069",
        "grid": `光月海人不萬舞得斷正軒器
                 日打水可千紫春宜寸揚昂宇
                 兩進可貌紅載風步得進氣寶
                 難退斗像揮歌難酒招退尺光
                 一堂量金灑行千逢不兵還珠
                 作鼓如如自載杯知仁成買積
                 氣土煙山人舞少己義空齒馬
                 仙樂火間光秋共白賣口長徒
                 境神快陰天水一空在無無勢
                 幻如似違錯長色話攔遮功不
                 奇箭日誤誤陽涯爛海骨成受
                 緣梭月撞打奉差角蝕枯萬祿`.replace(/\n|\s/g, ""),
        "answer": "寸金難買寸光陰"
    },
    {
        "id": "070",
        "grid": `乳活回箭傷雪外目中送食蒼
                 軟臭頭是人強名利無炭兩指
                 禮硬未暗中新收霜下全黑鬢
                 順尚兼乾明朗不雙天上牛顛
                 力有往淫水獲朗古太刀倒合
                 滿烏花來況信不乾小乾聯碧
                 話香土好每下美試坤珠筆匠
                 境掩逸回月言時目伐口心勤
                 難惡相心心圓不來設獨人國
                 勞將進印相轉做天運成傾橋
                 嘉本無大睛勉意造合轉室拆
                 勇謀而種快朵飴神宜鬼宜家`.replace(/\n|\s/g, ""),
        "answer": "牛轉乾坤好運來"
    },
    {
        "id": "071",
        "grid": `冬氣風意炎清平髮間容明珠
                 豪暖帶炎有時路分廢察待人
                 膽自夏為白見百齊秋百采斐
                 鐵日求涼朋手人毫舉色無於
                 花開遍多起之規秋迎望東迫
                 妙地善多福家收頭方刃然夏
                 啟手易得不冬趕原大倖而暖
                 賜有回不藏上烘落取開款解
                 雨毛末春藏失落先門寧息村
                 錄千加需花同動見生當幸事
                 理欲九上湖秋山斥生於戶林
                 得勞分動停雲月死放交安對`.replace(/\n|\s/g, ""),
        "answer": "門迎春夏秋冬福"
    },
    {
        "id": "072",
        "grid": `外不意是利勞星下里奪詞強
                 世可兩小無拆獨八人年人言
                 強外三袖裡勤力木六所華歡
                 中原心慧清份昆不難成實孝
                 甘內當心馬風東事家支耳東
                 乾方寡機耳春心立一破窗馬
                 心慾由方立不業當大事人風
                 望字報中管斷務任發難無亡
                 小貪落稗流之章正行之易成
                 失大官花急窺市取業大便工
                 姓野不污零照事利義器仁名
                 史變成一吏相膽肝貪晚成做`.replace(/\n|\s/g, ""),
        "answer": "清官難斷家務事"
    },
    {
        "id": "073",
        "grid": `日識成雨一化行笨恨鬼靜警
                 月器棄諾蛇足有珠行宜接動
                 可氣千三添不於癡無神宜草
                 箭金人鈞心獨而老主仁正催
                 假成語識一二利鼠民才發風
                 虎為城無假髮意愛譁意義器
                 假落二無包均物眾不外言功
                 威及可洩受予取人守釋成在
                 大危留志百寵生如細身手消
                 有可在芳市遺若下退季如香
                 險必取旦向臭求驚為天仁玉
                 得曲中直夕萬年大樓西門損`.replace(/\n|\s/g, ""),
        "answer": "三千寵愛在一身"
    },
    {
        "id": "074",
        "grid": `做狂動忍血止心如知易讀寡
                 亂大性不濃水膠虎一可生鮮
                 湧枚正心於似樑添世苦不生
                 書不井人漆上一翼天路死如
                 住籌蛙底君技語路雨之魚日
                 部井人子之子成滑交德行中
                 隊不關長虛蛙織頭水雲下天
                 舞霽山天無烏接為流心負母
                 輕斷核河粗耳有水地量純心
                 舉描豪茶章語落零妻賢良不
                 妄秋淡口成石花水泥地廣大
                 動飯無寫出頭意情尺無火水`.replace(/\n|\s/g, ""),
        "answer": "君子之交淡如水"
    },
    {
        "id": "075",
        "grid": `瞠目結百呼時曠巧三緘展莫
                 一言不應一廢荒語妙其明名
                 入絲和蹶違文謬誕如珠難不
                 扣思不讓多情不實不一見蹤
                 人振偷苟成事並名日經猶影
                 弦心生且過茂之三傳憐香氣
                 天蒼問境俗隨土秋隔惜玉急
                 涯海遷馬司生功成失敗中有
                 田桑長不土服之足掛生入誤
                 天地無長宰相母不智生途歧
                 沙鷗痕過久撐裡肚禮多不息
                 心信生風雨久黑月怪不謀陰`.replace(/\n|\s/g, ""),
        "answer": "不經一事不長一智"
    },
    {
        "id": "076",
        "grid": `偉洋及鬼北普老接同燒努序
                 讀人棟老怒成修避肥婆漢接
                 秀詞舉鄉如穿重修選生言從
                 書地下足生就賴各兒之度遠
                 欲開關紅輕善維育有女課方
                 林哭更少男重女物可千情來
                 儒外無信事綠逆三不密秋長
                 所使女淚對向女入木救之由
                 欲練為天如牛操動勢好目小
                 指工舞下行雨彈住套不見大
                 狼司大到之不下琴識收兩現
                 負戶不分得手快丁好心勝立`.replace(/\n|\s/g, ""),
        "answer": "男兒有淚不輕彈"
    },
    {
        "id": "077",
        "grid": `計所快人慢字一成不待人接
                 人書圖按工出重變為倫傲物
                 鬼牢捕羊亡細活心常意不以
                 如依入畫質為謀皮常氣急類
                 混虎蛇雜餅虎人舉開很敗聚
                 口添添雞混充疲掩一肉壞多
                 足花犬翼天潰飢力人反顫離
                 錦不生馬真爛不不目耳三掃
                 寧赤天下之從恨成勞積買緣
                 免中馬無心勞仇新軍師珠頭
                 人中亂雙動師傻傻洋洋環不
                 拉拉舞丁眾動重子刑牢廣案`.replace(/\n|\s/g, ""),
        "answer": "畫虎不成反類犬"
    },
    {
        "id": "078",
        "grid": `之九我必三兩兩意獻野天無
                 尊五才有獐三露一一一人下
                 紅厚顏用頭宮姑點枝曝知問
                 日無恥六鼠則事六草院十窗
                 百好臂路色圓緩路婆拿徹寒
                 台年攻於分兵神財九撲反梅
                 奔波大心之下真穩而鼻敗香
                 勞相宰計露流情大化險為夷
                 能肚走昭天偃草上之束勝高
                 撐裡馬告下善行山達手寒處
                 船水上蜃海下鳳飛龍無首不
                 家上任樓效春舞風群策群力`.replace(/\n|\s/g, ""),
        "answer": "三十六計走為上策"
    },
    {
        "id": "079",
        "grid": `往瞞贈鯉門大晚石之正師碩
                 信來天雙成器沉大股到我宜
                 書不有過雜大靜行顯將余不
                 言立河憤海平心露人身其時
                 著拆撇慨躍各頭鎮善能手田
                 橋風踱敵有角為均異之藍飄
                 行欲雲千籌聚力其士薄飄王
                 心少秋四精同敵才主欲如添
                 朱領花會面神高互仙謀不雨
                 岸撥神秋虎八通潑成風而約
                 勞風春會斗有方廣灑同道合
                 亂司竹樂無蘭停揮大仇愾骨`.replace(/\n|\s/g, ""),
        "answer": "八仙過海各顯神通"
    },
    {
        "id": "080",
        "grid": `徐成勝華英秋東廣邀岸透綠
                 心受安物池漲夜山天水石黛
                 車不起投中雨明巴再下仙履
                 水力名往石水雞鳴狗起芊鮮
                 杯一行來秀問盜坐到起不爭
                 無席畫雲處賀路上山細風闊
                 使依勝和流交滴行股吃手亂
                 出撥無從謀水替人醋麻空反
                 尋師司靠穿樂下真湯美各昂
                 人假工石天通吃天時不水撥
                 酬通記私通吃天負我餘一正
                 味道科少二康飯師之下一方`.replace(/\n|\s/g, ""),
        "answer": "靠山吃山靠水吃水"
    },
    {
        "id": "081",
        "grid": `天春海火師冬先欲勇無天世
                 重夏樹痛業犯暖往雙全態界
                 數銀秋暮改險直夏大炎動轉
                 花夜數葉雲前藍晚涼器竟如
                 驚風深先出田非影成銀人商
                 不經禮人種有含殺社引入勝
                 落後頭玉靜瓜機在卷槍倔利
                 兵地來勾門共得可握每天品
                 落難虎居心角供瓜乘稍商一
                 離上騎立上頭工勝股保竟蠟
                 角下力利大老追以頓失去機
                 手其傾侵一擊功子矛賀可不`.replace(/\n|\s/g, ""),
        "answer": "前人種樹後人乘涼"
    },
    {
        "id": "082",
        "grid": `無不共帶海大無門開戶放此
                 牛強嬌天仁主道東井一駁手
                 喘字安人新勝窗底虎騎難上
                 月習學數言事之下龍一慣以
                 下自時席發蛙在不表工事機
                 佬生作盡不託所人武成無會
                 人字方自忠負才留為為法難
                 之滅正心受報所離失敗無得
                 初同耿制童家國託在龍田見
                 幸耿於顏暴亂之樂澀設寒火
                 本人無專悟空受小色社小風
                 善悸線勿言兩細雖攝涉店持`.replace(/\n|\s/g, ""),
        "answer": "受人之託忠人之事"
    },
    {
        "id": "083",
        "grid": `山藥當歸枸杞夠山樣當歸民
                 貌神內離人留不假片任不脂
                 若容寬憂安號正出甲聊歸民
                 鬧電天居外分後以生課孫糕
                 訪回樂無天患守經不入指見
                 電業執法無所示己開離死人
                 路之受窮遁在青展拓不仁見
                 氣必經制形出樂脈救六意至
                 寒器含被於天善此人大義盡
                 沒梅花藍知人號命不順校原
                 大二不命者賀施不使疲草平
                 漏一價守鑄祝語該二不表裡`.replace(/\n|\s/g, ""),
        "answer": "生於憂患死於安樂"
    },
    {
        "id": "084",
        "grid": `火樹微紛正帶戶養一意功勞
                 紫銀求不芳削位素品成心勢
                 如有花飢足東餐有不牢不一
                 如山求適紹道道居力兩精變
                 驢薄履必食克置阻立鳴東雜
                 厝窮冰兩硬身浩身人窗味客
                 林出計敗敗話勢大事理得五
                 竹造擊名重俱蛇發石外成器
                 頭峰裂情游完傷添孔沉綽度
                 術是肝千意刃江武魚綽大偉
                 養仁輕里鵝邊有落有如成水
                 外不理毛河力藍餘暖送得中`.replace(/\n|\s/g, ""),
        "answer": "成事不足敗事有餘"
    },
    {
        "id": "085",
        "grid": `說人神道極剿氧哪裡這禮關
                 來病眼志心角養拿理仄理官
                 畫神盡高同菸煙一熄不升相
                 長經氣工手道合神離行升互
                 畫傲宮一貌低合風生火火不
                 短逆文岸落風合走冒師器相
                 說不然垂改千催三火得成官
                 值到按說涎巢丈草寸入傅群
                 息領末名仁三換進動潮魔無
                 新息不命喪薪尺貸無亂餓蟹
                 疾痛關相不戶不玩舞不老可
                 首天薪相之安卵股坐了梗擊`.replace(/\n|\s/g, ""),
        "answer": "道高一尺魔高一丈"
    },
    {
        "id": "086",
        "grid": `妙語如豬無蟹可擊激不可淫
                 入無投肘全安流所遊佳上火
                 品投論逐分分崩離路怪光一
                 樂知惡守口如平析失隨無心
                 能善己一片古不人心所位一
                 言道好知東冰心所有新跟易
                 凡善可施彼受欲軮樣同序取
                 清陳效不守闊制擒歸大國特
                 爛顰仁熬可不賀於故三稍予
                 地不碑不抗一盡成人縱安情
                 義氣蚊雞起舞世成寧缺勿濫
                 心欣辛的找凡虎箭的煩躁求`.replace(/\n|\s/g, ""),
        "answer": "己所不欲勿施於人"
    },
    {
        "id": "087",
        "grid": `成詩路耀閃安重行護朔碩口
                 步樂因雙居況實不雲意負安
                 七背雙禍喜賽趕由達流見平
                 為對涯起得臨駐徑詞水水與
                 對匿讓蕭洗福門薪形車背成
                 目船竹牆星高刀抽單色入高
                 塑水道高無非潤情影騎下蒙
                 發漲照法遠中珠原隻雀天市
                 造告無仁走不生咄實賓門涯
                 下天於米翼如分有開至平羅
                 不為待而咫日中高工如名若
                 有立飛濟尺鳥天信下歸重歸`.replace(/\n|\s/g, ""),
        "answer": "福無雙至禍不單行"
    },
    {
        "id": "088",
        "grid": `根深家人小戶大處異身因禍
                 蒂固思魂魄凍心驚首小福得
                 當率遠熟神積之秋失魂落破
                 愛局三來慮一葉大意色急急
                 情兩者去儀容無憐人中忙前
                 志不自迷言態大所生將忙途
                 拒在警多一殺萬智有記盲無
                 人從必板落百持千若口茫亮
                 於失一得落大內一依愚無光
                 千眼取而外方遠戰成百事心
                 外原驚空終目心膽名事順趁
                 則八七亂心於顫驚永可意如`.replace(/\n|\s/g, ""),
        "answer": "智者千慮必有一失"
    },
    {
        "id": "089",
        "grid": `結草銜環桓相扣蠢憂人非馬
                 無悠菅洋洋傻傻人天主耳無
                 秋遠閒人蠢才痛弦心東死餓
                 毫棻弗兇命心哭消風道冥不
                 無犯愉界疾素留物剛行進土
                 新可扯首牽言替地進土草兵
                 舊誰取疲累拖厲形行琦車偃
                 交雨與急拉知採色毀促干降
                 涕鼻新爭己一遒樹幹人由之
                 養人席知瘋易雨勁大小不小
                 帶缺彼器晚成十成有是車捲
                 任不分軒稚足改測猜力沒秩`.replace(/\n|\s/g, ""),
        "answer": "疾風知勁草"
    },
    {
        "id": "090",
        "grid": `花落目排體地界本受馬脫線
                 零的是中山膚末制使中寶寶
                 嘴子息事無倒於上紅赤雙無
                 神老寧粗置人海杏聲吐傳軒
                 建養搶人隔大出兇東人庵然
                 漲花順中面牆庭殘迪中丁小
                 大刀庖水四方有廣西拉丁波
                 改闊斧組推八雲耳眾拉丁解
                 革希衣陳三舟集每雙望牛次
                 發憤出食下井及為入出所密
                 喚新推名光落可飄醫對格歸
                 器英相卵磊如危相敗中山隱`.replace(/\n|\s/g, ""),
        "answer": "牆倒眾人推"
    },
    {
        "id": "091",
        "grid": `諱寄人離下虎久仰大明哲保
                 紀疾究難騎病人利地時天使
                 術仁忌辭成心合噐大虛鳥有
                 人心術醫功望煩刀君子天刻
                 齒五火髮放棄同意正花前舟
                 廉恥體燃暗病天花亂人月求
                 義理眉投相牛入墜亂裡下見
                 禮之明憐地刀藥膏口祕腹劍
                 急夫股吳虎超然原肓密急氣
                 婦中下蒙天試物外方血敗壞
                 忠孝生阿園逃外世內剛金新
                 愛仁擊智中生升不息示寧人`.replace(/\n|\s/g, ""),
        "answer": "病急亂投醫"
    },
    {
        "id": "092",
        "grid": `生不息雞犬天當高是年半濁
                 天生犬一鳴驚仁不以少清半
                 息不張羅假狗讓虛不名狂輕
                 寧事星燈營工盜更七八人雞
                 人棋火黨結私事劫上九十毛
                 比通布義遲綵濟富八層裝蒜
                 明鳥下無三來信貧廈塔樓脾
                 花前月顧七陽口窮五沁人心
                 與香茅反十二開君福味相心
                 灶廬鏡對一萬涸泰臨舖雜印
                 交乳水花銀樹火薰門天張陳
                 溶中撈月人墜湖急席毯夏年`.replace(/\n|\s/g, ""),
        "answer": "三更燈火五更雞"
    },
    {
        "id": "093",
        "grid": `成語謎真相一富類求柴若渴
                 不思議武貌麗秋茶醋米油如
                 真三國大堂海思之醬鹽釋工
                 向無雙皇堂上司圖絡重親毀
                 大學地下天大展刻負落力及
                 白無海羅雀后骨晨推荊一人
                 頭涯地用不銘土光渴己請家
                 斜網策見心離求柴淒親及罪
                 老狀天略雄良不風量言不人
                 城日闢有才金苦棄欲秩贓快
                 池開蒂小必雨死無墳俱玉石
                 重治成城連華對證獲消苦索`.replace(/\n|\s/g, ""),
        "answer": "皇天不負苦心人"
    },
    {
        "id": "094",
        "grid": `離水捨期依坐裂餘後基時不
                 剛盟火心懷落地開福簿惡于
                 至陶安不秀看雙闢完竟無離
                 單理亂步容雞顏功庸不群輕
                 得記彌江當語旋普平索而商
                 掏大浪樹重車補股居易言積
                 雲天大心蓋裡外刺舉高近在
                 光招長刀橫萬快亡防越臨人
                 風開共地闊世補火望瞪任下
                 影辦誘如久斧應羊子禍握卷
                 一母方烘似別輪過倒貨所汚
                 堂見玉花動輸過倒貨所汚墊`.replace(/\n|\s/g, ""),
        "answer": "長安居大不易"
    },
    {
        "id": "095",
        "grid": `故溫仁愛撒散化顯為怡新鬢
                 知平和所師舞女蛇一人剎有
                 新白易捨離無花滅足珠玉容
                 雨無求近所事集智風天胸乃
                 舊是遠不人事多腋而有大打
                 厭非在留老謀身算成殘腦不
                 新不必所接非不竹廢裘共用
                 洗芬相月不非入臧不戴器詞
                 字股界機修惜想醒天義不容
                 沾優花是行滑人下是地日月
                 沾蘭花爛指事無得以退有天
                 是手馬為路雙尺吋進為年經`.replace(/\n|\s/g, ""),
        "answer": "謀事在人成事在天"
    },
    {
        "id": "096",
        "grid": `心同意二醫容緩癡容易刻不
                 地協床心三課人讀勤士考毀
                 婆力善異新說古成進沒思名
                 口力剩不夢止鳩飲偷章取顧
                 苦接不世滴渴一天水斷名義
                 日辛天知風無換流節思開轉
                 為以下為所日測下義來源運
                 化零繼有欲措下策走到後來
                 整決始夜手不及添為時一先
                 斷有門法郎畫心蛇上選馬當
                 終矢幣做情自粗族龍萬中料
                 亂地放字妄易大雜混吃等始`.replace(/\n|\s/g, ""),
        "answer": "日有所思夜有所夢"
    },
    {
        "id": "097",
        "grid": `含血噴目中無盛氣凌旁若無
                 捨己為暗箭傷以貌取亦缺人
                 己大破言人平近人步三成人
                 一汗淚涕畏可易亦互步梁虎
                 體滿顏光為有趨謙有自為山
                 生投一六色笑微和沖禮牧營
                 生小柳五湖四裡蜂相比文相
                 皆地內花一海中藏針對比轉
                 息俱天小大十雅百刀槍皆人
                 焚之架綁拿俗廢七感人肺是
                 毀如田九共待眼神會交臟六
                 泰山穩傷舉一反十全美集腑`.replace(/\n|\s/g, ""),
        "answer": "五十步笑百步"
    },
    {
        "id": "098",
        "grid": `壓雀無聲一聲聲不息榮衣有
                 身柴高八斗運舉獨心匠衣戒
                 與垂一心意一一如忠始不有
                 草綜涎石反無窮白吃貴捨環
                 嗑木不三二世風日才人婊一
                 不器皆同尺鳥外禮投珠光名
                 容髒晚賓殺軒鏽桃賢寶身金
                 緩成冠身宇雞報色源下先人
                 好因成裡不李儆無可章士因
                 色仁望擇戴默密猴文餐卒仁
                 之而食學問淵薄雌不達異而
                 塗義塗嫌妻涼母品學皆憂義`.replace(/\n|\s/g, ""),
        "answer": "二桃殺三士"
    },
    {
        "id": "099",
        "grid": `修七幸患秀燻酌弄無行真劍
                 生午如茫然外亡過巧圍大重
                 身養刺魚圓一慧鏡農言詞盜
                 有犒心內得新花中拙以其鋒
                 背快方大負水勤能食先利假
                 助心驚水月古千言者必力滄
                 動人落為環故而膾多勞海私
                 魄石器井天肥炙瓜民桑力談
                 出昂宇晚下人燕店田不淚塗
                 手宣記蜜口石之瘦從李聊如
                 闊營為克水欲平心共雨下生
                 漲步劬審劍腹鳴魏化整炭靈`.replace(/\n|\s/g, ""),
        "answer": "肥水不落外人田"
    },
    {
        "id": "100",
        "grid": `非怕莫乎及有心秀暗昏記夜
                 不你在屬其所不術色勢門昨
                 眾望福竹天愉空需不可除小
                 人不負金信換虛兩羅正餐樓
                 強檔門拋玉日立雀光晴光遊
                 縱倒排當一良料特目短不戲
                 人爾推磚戶事言中別轉淺水
                 出貝言引如對無聽輪投一半
                 反任鬼神牛人天成計降而書
                 雨目記彈命包地應映從天課
                 訥依琴關特色量相易懂字天
                 皮膚天正運膽心心簡單然無`.replace(/\n|\s/g, ""),
        "answer": "事無不可對人言"
    },
    {
        "id": "101",
        "grid": `齒掛族不博雜草天風不山下
                 難僧看學生養儍行馬相上海
                 佛面多一妄自菲薄牛行多所
                 面聞一粥飯力自強下及空在
                 世知十不少更天效知星換物
                 山好事遍官生行地事移極樂
                 懶吃學反民君健理備必子欲
                 做貪拚不人見子覆反鞠躬養
                 害怕聊詢倦疲義過應盡坐親
                 所生器諄諄憤發勇度瘁以不
                 不死而教填強圖氣為死待償
                 在無憾膺品嘉加可一槍斃命`.replace(/\n|\s/g, ""),
        "answer": "多行不義必自斃"
    },
    {
        "id": "102",
        "grid": `克江辯騎水擇一知枝轆饑鹿
                 知邵虎暖鴨亡善笑裡腸刀井
                 託難磯不唇齒見顧置下底任
                 下指而裘應義相依直之留意
                 此非鹿退勇而君樹蛙女門望
                 挑所罪為勵字大大婚誓腹指
                 失撥有戰馬招重器不為牛成
                 大因離書風咄千兩晚刀君龍
                 小得德間空咄立金小成老伴
                 空禍兩牛不訴逼試難無下虎
                 復人福衣泣容人妙此顧猜月
                 巷國光萬對向髮筆失生花前`.replace(/\n|\s/g, ""),
        "answer": "兩大之間難為小"
    },
    {
        "id": "103",
        "grid": `真成假弄等一人語霆異獵恐
                 憑千帶絕華風無吹重夢命懼
                 實義正的臥倫冰毛狼心師炸
                 據無出底次箱庇求醉壕長彈
                 久其右其辭粗稱翁樑上君子
                 登把回全不心知星正臣臨虛
                 峰刀心轉達意羅袖義之天烏
                 燥枝相氣意棋月殺手不下有
                 急發風用布打逢角居旁容靜
                 的功夫事拉不噴敵爾拉觀詞
                 畫鳥天醫無縫倒涕手其阿拓
                 夙興夜寐的犯罪人變子不思`.replace(/\n|\s/g, ""),
        "answer": "觀棋不語真君子"
    },
    {
        "id": "104",
        "grid": `良倚人地次手左秋手葉騎劇
                 無居老安門放言顏出掏犯中
                 定所求賣開下含而無信然伊
                 勝無友火老天並廣宅因全無
                 法求包薪負不危心樂六五法
                 榮富親人家招仁在親法天新
                 仁度立戶兵厚其不旦大果印
                 買到功買功中認落義夕心報
                 虎買馬成櫝地日滅地子為港
                 討還身下人還親大由誤泡套
                 價退虎棉海之珠換相人自遠
                 下難騎神寶保美輪搖朋有方`.replace(/\n|\s/g, ""),
        "answer": "買賣不成仁義在"
    },
    {
        "id": "105",
        "grid": `有為泥化猩人為患新腹大憂
                 戒標有以滿猩活死去來制如
                 有竿金堂引對向趣喪不容法
                 環三神玉症為青龍於心置同
                 繞良病下良亂榮出無死病天
                 刻日藥莠刻言檢往於相嘴狂
                 欲苦不苦從病不非憐藍針無
                 慾齊耐入口利命由口儘插縫
                 獄勞不饒慾是多事忠陽價線
                 出敷命薰轉回心職直質值植
                 禮清心意重非首非少虎憐物
                 心寡事重新入想製言皮城人`.replace(/\n|\s/g, ""),
        "answer": "良藥苦口利於病"
    },
    {
        "id": "106",
        "grid": `同共其食自作自自心安理得
                 甘吃果拜討打根受心心不猴
                 共頭子歸苦葉落歸相償雞殺
                 苦萬辛千吃秋知落失血債血
                 龍含茹裡喝一葉天大仁氣術
                 鳳騰扒手擁蜂下指正方心一
                 二外躍而而至手所剛不鳴仁
                 胎紙上下其手百阿為驚為見
                 東死心樑人發崩天人力義真
                 窗心腹規百裂地盡力勇往肝
                 是中內中四分其心為妄大膽
                 發苦酸矩鬼才高八十指重照`.replace(/\n|\s/g, ""),
        "answer": "吃得苦中苦方為人上人"
    },
    {
        "id": "107",
        "grid": `賞山名站睡膚切之同力心從
                 落釜沒綽和口順開逆悅大不
                 辰井餘無神另六思誠道年比
                 週破下不投無主服隨佈至時
                 信門弄石人其微心認前公年
                 海口破網班斧所不上故洗次
                 訓天開紙聚欲養好至無所反
                 驚一素河醉精揮神嘆理客事
                 面增物唸蓄金會出淺為名是
                 日上業銳如頭迷神主入觀言
                 月山大土臉有發化共深陳止
                 辰乾常時短小竟感人費府參`.replace(/\n|\s/g, ""),
        "answer": "精誠所至金石為開"
    },
    {
        "id": "108",
        "grid": `出笑無兩猜冷渴心口不四袖
                 冰雪袖小飲大眼手無三手伯
                 聰清劈不識局面旁其旁門仲
                 風面玉身自已高下觀左騖天
                 木容希潔愛定分道謀道不天
                 心愁別物惜安死左事相同大
                 面生開當力屈臣軍人成事在
                 生吻務貴仁忠分偷犖手拉始
                 入之洛陽紙不心天犖吉作利
                 急分手醉交二讓換大俑實如
                 快銀金頸捨本逐物者至歸里
                 死迷途知返蝌末未樂心似箭`.replace(/\n|\s/g, ""),
        "answer": "當局者迷旁觀者清"
    },
    {
        "id": "109",
        "grid": `午國有情齜天單騎易字得來
                 示原可牙舞崖過天亡不而無
                 油雙咧事牙學雨營左羊希入
                 辭嘴價相一立鳳問柳洋補行
                 初夢滑遷安毛心天置花木牢
                 星生戲舌麟無不身贖草獄有
                 場作築角愧勞事拔能之到逆
                 逢人外影而外過晴災生堂因
                 破一帶獲力千敬公紙知錦謀
                 斬華手子胞尋事柔懷上上昏
                 空勢安包保公水不添一談擁
                 站思求鄉辦定滴花勝探而兵`.replace(/\n|\s/g, ""),
        "answer": "嘴上無毛辦事不牢"
    },
    {
        "id": "110",
        "grid": `快樂史事事遁不青人才雄英
                 仙神作無所空信春輩謀年少
                 前無俑滔前屬心喚出在不回
                 古仆者絕不例下想三更火臧
                 人來後徒成虎為入事出類拔
                 高者無繼無依沒非非成不萃
                 采興力勞功然掛齒終因足而
                 心驚師苦高淚下努難身先一
                 魄動輒問高一餐力飲忘士卒
                 眾生得咎罪等飯加年水思源
                 云云失雪加君子之知再世桃
                 說紛復上霜利交相恩造外陶`.replace(/\n|\s/g, ""),
        "answer": "前事不忘後事之師"
    },
    {
        "id": "111",
        "grid": `有求必硬離流失故幸彼此時
                 姦若盤石以歸所辱不程顧無
                 裡不五二使退天命門得以為
                 表一火如喚違為立寸當晚象
                 不情取來狼笑雪進狐欲戶器
                 法專木狽者似尺假迎成大對
                 大瞻為花樂不虎還亡補英苦
                 西奸前此不威拒喜洋焦英功
                 滿月星顧疲雨酸氣得斷中高
                 下綿派得後安潘離意義非如
                 海堡城春世再欲夢孟不離教
                 王蟹筍滿堆高文捕網輕想人`.replace(/\n|\s/g, ""),
        "answer": "前門拒狼後門進虎"
    },
    {
        "id": "112",
        "grid": `在神在近咫上加油而勃蓬絞
                 荒地老尺目怒火然生展汁盡
                 天若天比鄰中燒目克珠璣腦
                 爛涯知彼百戰無光如勤字漏
                 石枯海百勝法定人能豆克小
                 沉市蜃角紀天勝補學雲浮儉
                 大是樓日充汗拙富品以如貴
                 海中撈月棟牛五道兼優致富
                 馬革辰星唯車水馬貌月隔用
                 裹首屍命妙魚雜龍蛇岸夜愁
                 不容是水唯目處周觀以然星
                 迫從膽瞻肖三除火原燎可火`.replace(/\n|\s/g, ""),
        "answer": "學海無涯唯勤是岸"
    },
    {
        "id": "113",
        "grid": `掛師開山聲以息不聲歸一鶴
                 洋均門石劈東軟修幅東命受
                 頭頭建東登峰擊邊張斷龜飛
                 是狗山床窗倍登西照金掌天
                 道再委快辦事望辦一密米生
                 起課伯續半公發目中有人望
                 來亂去亂貂百十延見至之先
                 必智障千慮行年惡壞色好貝
                 信失萬有必益口好不冒望新
                 口口說無壽若住者合赦之友
                 雌門開運懸上賀神任重到遠
                 藍波批河斷山離鬼正人均子`.replace(/\n|\s/g, ""),
        "answer": "十年河東十年河西"
    },
    {
        "id": "114",
        "grid": `千百碼之便萬面具一由想小
                 解均外特萬壞人面此力營大
                 精闢包逆樂不皮到盲賀則掛
                 理冒死羅五此一人學數一土
                 治逆發灰萬元摸本科漏耳木
                 居鄰八達復象氣千萬目住科
                 自方四始少燃日大一利照丙
                 遠力亂不峽嫌女新傷造直及
                 物終更龍三席幸課月傳禿子
                 棄事趕生大草鶴司梅異鐵打
                 高膏思之訥鬧歸新正好散遠
                 號要冒風木價叫解費子欲兔`.replace(/\n|\s/g, ""),
        "answer": "一元復始萬象更新"
    },
    {
        "id": "115",
        "grid": `交之種角旁名量生狀招器大
                 意來如觀堵不亮見頭兵美晚
                 湯仁者人被苦慌離捲名惜器
                 洩清綽不棉落盡失土理香成
                 水人易是拒下運甘從尚器稱
                 不招器大大快來知來往意多
                 痛兵美晚虎木先白人日愁真
                 冰皆木草好累當同明善方意
                 心意一花水冠入居感碼任長
                 使照絲泄如慣族龍萬中料易
                 一城不變止萬雜混吃等始料
                 如通卦宣心木才發風氣中之`.replace(/\n|\s/g, ""),
        "answer": "來者不善善者不來"
    },
    {
        "id": "116",
        "grid": `扣迷紹集長圖騎住誤恆福良
                 出主客裘事化志法網大辰異
                 換為反賓紛在信觸方美想幸
                 偷撥各曇必鏡人口景天心晴
                 入亂政得花榜上為開傷只名
                 敷為易水題一大山中河情因
                 日大月天習言現別裝我夜有
                 上爛開瀾不以不離百老神泥
                 竿蒼情慚甜懷為年生當給落
                 曬樂夜迎割獲好常變出神化
                 對色血瀾心合談意行溝神百
                 抗揚英訪東至成所金玉梁研`.replace(/\n|\s/g, ""),
        "answer": "好花不常開好景不常在"
    },
    {
        "id": "117",
        "grid": `鹿指所有心一當先以其緘三
                 投為意一強子目逸事身口上
                 馬其氣人欲水待了卒恍作奏
                 賞臉所風發勞師動然馬前則
                 知難不好力兩眾大花樂土間
                 常理出美全心悟明天草木街
                 映像十其從自日知之水來兵
                 放性美雙不黃命自人檔降煙
                 豐從心量節意故知磨善撥秒
                 醫不力無雨分遇透略雁任號
                 族詳甘降霖天鄉仙爭沉魚落
                 石死欲久早逢他欲像字水鴿`.replace(/\n|\s/g, ""),
        "answer": "知其然不知其所以然"
    },
    {
        "id": "118",
        "grid": `河上樑不上樑拳腳相向政敵
                 大海行正歪上股子隅柳暗由
                 撈針雲下下天設而道我不分
                 龍鋒流得效不泣屋明聽塗說
                 潭水水以偏概全眸樂上下已
                 虎職天不循職皓白知勿施所
                 穴視倚色營齒好人於書欲不
                 無所耽道私樂善施窮人達目
                 井不能耽炯任中山柳暗花禮
                 不然言炯兇窮惡明眸皓明又
                 無中有生然水極水複疑無一
                 學神有序井山光秀出逃路村`.replace(/\n|\s/g, ""),
        "answer": "明知山有虎偏向虎山行"
    },
    {
        "id": "119",
        "grid": `凡如樑濤月調正琴合而歌刻
                 堆夫幸上海人滿記知出骨補
                 積星俗松君逃孫人活銘共雨
                 濤大博子裡子善而心物慢年
                 派雲獨天滿任堂登豐不細附
                 日處之下字非想入豁川古浩
                 不寒選推赤運同思因然駐百
                 天義一持心然成小口賜大納
                 物之之時日置失蜜可依相度
                 木以入財無大腹天兒戲日緊
                 恆為類先咄劍驚刺大如碩果
                 枯腐主聚踱逼人為年有可存`.replace(/\n|\s/g, ""),
        "answer": "以小人之心度君子之腹"
    },
    {
        "id": "120",
        "grid": `心不踏鬼敲門天題小心易義
                 由神弓關相息下無法無添不
                 生生不息事憤一動雙插辭一
                 像花鏡寧平走步舉一翅難飛
                 水君人平了步投魚兩畫餅充
                 得魚如之高神青無水得激天
                 池殃弄升斧化入雲路敢步盡
                 疾捨墨鋌而走險任碧石二鳥
                 書文近舞盜大重為一白焚想
                 振為學求無道打小夷二鶴入
                 彼薄尺厚遠爭恨鋼人窮煮飛
                 筆橡皮據理力鐵成不志琴飛`.replace(/\n|\s/g, ""),
        "answer": "寧走一步遠不走一步險"
    },
];