export const jinyungList = [
  { title: "連城訣", note: "我很喜歡的一部，一點都不遜色於主流的幾個故事，主角絕對算是全系列最慘，令人不勝唏噓，但至少最後有一個好結局，篇幅短，也非常適合作為第一部入門的作品", tier: "SSS" },
  { title: "笑傲江湖", note: "少數沒有朝代背景的故事，因為故事中人性的險惡，在任何朝代中都比比皆是。這部作品呈現了十足的政治隱喻，在權力鬥爭之下，我們都只想當灑脫不羈的令狐沖吧", tier: "SSS" },
  { title: "鹿鼎記", note: "我覺得最好笑的一部，主角最接近惡人的作品，也是唯一不會武功的一個主角。以韋小寶的視角出發，又會讓讀者無法真的打從心底討厭他，這讓我有種體悟，人都是雙標的，端看站在誰的視角看世界。韋小寶與康熙的情誼是這部作品我最喜歡的部分", tier: "SSS" },
  { title: "射鵰英雄傳", note: "三部曲中我最愛的作品，少女黃蓉俏皮可愛又聰明伶俐，溢出書本的討人喜歡。我印象最深的片段是郭靖最後與成吉思汗的一番談話，這部絕對能稱得上金庸最經典的作品", tier: "SSS" },
  { title: "倚天屠龍記", note: "雖然很多人不喜歡張無忌優柔寡斷的婆媽性格，又有「苦戰教主」的封號，但我認為張無忌是最接近凡人的主角，就算身負驚世駭俗的武功，世俗與情慾還是大多數人一生最苦惱的難題。張無忌與趙敏在小酒館的場景，是全系列最浪漫催情的片段", tier: "SS" },
  { title: "天龍八部", note: "蕭峰是金庸全系列我最敬佩的悲劇英雄，比起郭靖的「為國為民，俠之大者」，蕭峰更超越了種族與立場，他盼望的是真正的太平，孤獨寂寞、不被理解與善待，卻依舊犧牲自己，照亮他人。天龍八部是很有佛學意涵的一部作品，充滿了生而為人的苦楚，怨憎會、愛別離、求不得", tier: "SS" },
  { title: "碧血劍", note: "有些人不喜歡，主角與女主角都相對扁平且不討喜的一部，但我很喜歡這部作品的各個配角，像是木桑道長、金蛇郎君與五毒教，這些角色相比主角有趣的多，還有上華山練武的過程也很棒，我也很喜歡這部明末清初的時代背景，可以當做鹿鼎記的前傳作品來讀", tier: "SS" },
  { title: "神鵰俠侶", note: "三部曲中我最不喜歡的一部，與小龍女波折的戀情，讓我感覺像是推動劇情的廉價手段，楊過受盡欺壓霸凌也讓我感到難受。整部作品我最喜歡的部分是洪七公與歐陽鋒在華山之巔上的切磋較勁，一輩子的恩也罷仇也罷，都在相擁之下煙消雲散", tier: "S" },
  { title: "白馬嘯西風", note: "金庸系列中最經典的結尾，錯綜反轉的劇情是這部作品的一大看點，也很值得作為入門作品的一部", tier: "S" },
  { title: "俠客行", note: "最有創意有有趣的一個主角，喜歡主角單純天真的個性，讓險惡的江湖能夠有一絲的歡快，就像是金庸版本的阿甘正傳", tier: "S" },
  { title: "飛狐外傳", note: "金庸在雪山飛狐後的作品，程靈素應該能算我最喜歡的一位女角，聰慧冷靜，手段又厲害，像是神鵰俠侶中程英給人的感覺，但這也讓我永遠無法喜歡胡斐", tier: "A" },
  { title: "書劍恩仇錄", note: "金庸的第一本作品，有點像是水滸傳那樣的經典文學，描寫各有特色的綠林好漢，俗稱現代黑道。陳家洛是個扁平又不討喜的主角，很多人不喜歡這部作品，我也偏不喜歡，但是紅花會中對各個角色的描寫，還是非常值得一看的", tier: "A" },
  { title: "雪山飛狐", note: "我最不喜歡的長篇作品，有點受到飛狐外傳的影響，但理性上，我應該要知道這部的胡斐並未擁有飛狐外傳的記憶。這部主要在於揭秘上代間胡、苗、范、田的恩怨情仇，是唯一一部最後以開放式結尾收場的作品（倚天屠龍記我覺得應該不算）", tier: "B" },
  { title: "鴛鴦刀", note: "短篇搞笑武俠作品，老實說可以不用看。很喜歡金庸小說的人，全系列都看了的話，也不差這部就會順便看完的", tier: "B" },
  { title: "越女劍", note: "全系列最強女主阿青，金庸小說武學強度有個說法，年代越久遠越強，讀這部能夠看看阿青的武功，到底有多鬼神", tier: "B" }  
];
